bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
#include "registers.h"
#include "STM32F4-lib.h"
#include "AlternateFunctions.h"
#include "InterruptPositions.h"
#include "HelperFunctions.h"

#define HSEfreq 8000000

unsigned int RTCyear=0;	//global variable

void EnableFPU(void)
{
		CPACR |= 0xFUL<<20;
}

void TestSysClock(void)		//testing SYSCLK/5 on PC9
{
	RCC_CFGR |= 7UL<<27;	//MCO2 prescaler division by 5
	RCC_CFGR &= ~(3UL<<30);	//System clock (SYSCLK) selected on Microcontroller clock output2 (PC9)
	RCC_AHB1ENR |= 1UL<<2; //IO port C clock enable
	GPIOC_OSPEEDR |= 3UL<<(9*2);	//PC9 100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
	GPIOC_MODER |= 2UL<<(9*2);	//PC9 in Alternate function mode
	GPIOC_AFRH &= ~(0xFUL<<4);	//set PC9 to AF function 0
}

void ResetIOToInput(void) //turn off jtag and set everythnig as input except SWD pins
{
	RCC_AHB1ENR |= 3;	//enable clocks for GIPOA and GPIOB
	GPIOA_MODER &= 0xFUL<<26;	//PA13 and PA14 needed for SWD debug
	GPIOA_PUPDR &= 0xFUL<<26;
	
	GPIOB_MODER=0;
	GPIOB_OSPEEDR=0;
	GPIOB_PUPDR=0;
	RCC_AHB1ENR &= ~3;	//disable clocks for GIPOA and GPIOB
}


/*
void SetPin(unsigned int portbase,int pin)
{
	(*((volatile unsigned int *) (portbase + BSRR)) = (1 << pin));
}

void ClearPin(unsigned int portbase, int pin)
{
	(*((volatile unsigned int *) (portbase + BSRR)) = (1 << (pin + 16)));
}
*/

//Configure a given port from a 16 character string
//'a' - Analog function floating

//'i' - input floating
//'u' - input pull-up
//'d' - input pull-down

//'l' - output low speed, 2 MHz
//'m' - output medium speed, 25 MHz
//'f' - output fast speed, 50 MHz
//'h' - output high speed, 100
//'o' - output high speed, 100

//'L' - output low speed open-drain, 2 MHz
//'M' - output medium speed open-drain, 25 MHz
//'F' - output fast speed open-drain, 50 MHz
//'H' - output high speed open-drain, 100 MHz

//'A' - output low speed open-drain, pull up 2 MHz
//'D' - output medium speed open-drain, pull up 25 MHz
//'P' - output fast speed open-drain, pull up 50 MHz
//'p' - output high speed open-drain, pull up 100 MHz

//'n' - alternate function, 2 MHz
//'r' - alternate function, 25 MHz
//'e' - alternate function, 50 MHz
//'t' - alternate function, 100 MHz

//'N' - alternate function open-drain, 2 MHz
//'R' - alternate function open-drain, 25 MHz
//'E' - alternate function open-drain, 50 MHz
//'T' - alternate function open-drain, 100 MHz

//'I' - alternate function open-drain, pull up, 2 MHz
//'C' - alternate function open-drain, pull up, 25 MHz
//'c' - alternate function open-drain, pull up, 50 MHz
//'U' - alternate function open-drain, pull up, 100 MHz

//'-' - don't change
//' ' - ignore
void ConfigPort(char *cfg, volatile unsigned int *GPIO_MODER, volatile unsigned int *GPIO_OTYPER, volatile unsigned int *GPIO_OSPEEDR, volatile unsigned int *GPIO_PUPDR)
{
	char c;
	unsigned int n=0;
	unsigned int i=0;
	
	while(cfg[n] != 0)
	{
		c=cfg[n];
		n += 1;
				
		if (c == ' ') continue;			// Ignore spaces that are inserted for readability
		
		i += 1;
		if (i > 16) break;								// There is only 16 pins to configure, error condition
		
		if (c == '-') continue;			// Dashes are no-operation
		
		ConfigPin(15-(i-1),c,GPIO_MODER, GPIO_OTYPER, GPIO_OSPEEDR, GPIO_PUPDR);
	}
}

//configures an an I/O pin
int ConfigPin(unsigned int pin, char c, volatile unsigned int *GPIO_MODER, volatile unsigned int *GPIO_OTYPER, volatile unsigned int *GPIO_OSPEEDR, volatile unsigned int *GPIO_PUPDR)
{
		switch (c)
		{
			case 'a': //Analog function floating
				*GPIO_MODER |= 3<<(pin<<1);	//Analog mode
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'i': //input floating
				*GPIO_MODER &= ~(3<<(pin<<1));	//Input
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			case 'u': //input pull-up
				*GPIO_MODER &= ~(3<<(pin<<1));	//Input
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'd': //input pull-down
				*GPIO_MODER &= ~(3<<(pin<<1));	//Input
				
				*GPIO_PUPDR |= 2<<(pin<<1);	//Pull-down
			break;
			
			case 'l': //output low speed, 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'm': //output medium speed, 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'f': //output fast speed, 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'h': //output high speed, 100
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'o': //output high speed, 100
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'L': //output low speed open-drain, 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
