bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'M': //output medium speed open-drain, 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'F': //output fast speed open-drain, 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'H': //output high speed open-drain, 100 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'A': //output low speed open-drain, pull up 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'D': //output medium speed open-drain, pull up 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'P': //output fast speed open-drain, pull up 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'p': //output high speed open-drain, pull up 100 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 1<<(pin<<1);	//General purpose output mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'n': //alternate function, 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'r': //alternate function, 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'e': //alternate function, 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 't': //alternate function, 100 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER &= ~(1<<pin);	//Output push-pull
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'N': //alternate function open-drain, 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'R': //alternate function open-drain, 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'E': //alternate function open-drain, 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'T': //alternate function open-drain, 100 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
