bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR &= ~(3<<(pin<<1));	//No pull-up, pull-down
			break;
			
			case 'I': //alternate function open-drain, pull up, 2 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//2 MHz Low speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'C': //alternate function open-drain, pull up, 25 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 1<<(pin<<1);	//25 MHz Medium speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'c': //alternate function open-drain, pull up, 50 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 2<<(pin<<1);	//50 MHz Fast speed
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			case 'U': //alternate function open-drain, pull up, 100 MHz
				*GPIO_MODER &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_MODER |= 2<<(pin<<1);	//Alternate function mode
			
				*GPIO_OTYPER |= 1<<pin;;	//Output open-drain
			
				*GPIO_OSPEEDR &= ~(3<<(pin<<1));	//clear config bits
				*GPIO_OSPEEDR |= 3<<(pin<<1);	//100 MHz High speed on 30 pF (80 MHz Output max speed on 15 pF)
				
				*GPIO_PUPDR |= 1<<(pin<<1);	//Pull-up
			break;
			
			default:
				return -1;		// Error condition
		}
		
		return 1;
}

void ConfigPortA(char *cfg)
{
	RCC_AHB1ENR |= 1;													//GPIOAEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOA_MODER, (unsigned int *)&GPIOA_OTYPER, (unsigned int *)&GPIOA_OSPEEDR, (unsigned int *)&GPIOA_PUPDR);
}

void ConfigPortB(char *cfg)
{
	RCC_AHB1ENR |= 1<<1;													//GPIOBEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOB_MODER, (unsigned int *)&GPIOB_OTYPER, (unsigned int *)&GPIOB_OSPEEDR, (unsigned int *)&GPIOB_PUPDR);
}

void ConfigPortC(char *cfg)
{
	RCC_AHB1ENR |= 1<<2;													//GPIOCEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOC_MODER, (unsigned int *)&GPIOC_OTYPER, (unsigned int *)&GPIOC_OSPEEDR, (unsigned int *)&GPIOC_PUPDR);
}

void ConfigPortD(char *cfg)
{
	RCC_AHB1ENR |= 1<<3;													//GPIODEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOD_MODER, (unsigned int *)&GPIOD_OTYPER, (unsigned int *)&GPIOD_OSPEEDR, (unsigned int *)&GPIOD_PUPDR);
}

void ConfigPortE(char *cfg)
{
	RCC_AHB1ENR |= 1<<4;													//GPIOEEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOE_MODER, (unsigned int *)&GPIOE_OTYPER, (unsigned int *)&GPIOE_OSPEEDR, (unsigned int *)&GPIOE_PUPDR);
}

void ConfigPortF(char *cfg)
{
	RCC_AHB1ENR |= 1<<5;													//GPIOFEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOF_MODER, (unsigned int *)&GPIOF_OTYPER, (unsigned int *)&GPIOF_OSPEEDR, (unsigned int *)&GPIOF_PUPDR);
}

void ConfigPortG(char *cfg)
{
	RCC_AHB1ENR |= 1<<6;													//GPIOGEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOG_MODER, (unsigned int *)&GPIOG_OTYPER, (unsigned int *)&GPIOG_OSPEEDR, (unsigned int *)&GPIOG_PUPDR);
}

void ConfigPortH(char *cfg)
{
	RCC_AHB1ENR |= 1<<7;													//GPIOHEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOH_MODER, (unsigned int *)&GPIOH_OTYPER, (unsigned int *)&GPIOH_OSPEEDR, (unsigned int *)&GPIOH_PUPDR);
}

void ConfigPortI(char *cfg)
{
	RCC_AHB1ENR |= 1<<8;													//GPIOIEN clock enable, allows port configuration registers to be edited
	ConfigPort(cfg, (unsigned int *)&GPIOI_MODER, (unsigned int *)&GPIOI_OTYPER, (unsigned int *)&GPIOI_OSPEEDR, (unsigned int *)&GPIOI_PUPDR);
}



void ConfigPinOnPort(unsigned int port, unsigned int pin, char c)
{
	int portnum;
	portnum = (port - PORTA) / (PORTB - PORTA);
	RCC_AHB1ENR |= 1 << portnum; //AHB1 peripheral clock enable register
	ConfigPin(pin, c, (unsigned int *)(port + MODER), (unsigned int *)(port + OTYPER), (unsigned int *)(port + OSPEEDR), (unsigned int *)(port + PUPDR));
	
}
void TogglePin(char port, unsigned int pin)
{
	switch(port)
	{
		case 'A':
			GPIOA_ODR^=(1<<pin);
			break;
		case 'B':
			GPIOB_ODR^=(1<<pin);
			break;
		case 'C':
			GPIOC_ODR^=(1<<pin);
			break;
		case 'D':
			GPIOD_ODR^=(1<<pin);
			break;
		case 'E':
			GPIOE_ODR^=(1<<pin);
			break;
		case 'F':
			GPIOF_ODR^=(1<<pin);
			break;
		case 'G':
			GPIOG_ODR^=(1<<pin);
			break;
		case 'H':
			GPIOH_ODR^=(1<<pin);
			break;
		case 'I':
			GPIOI_ODR^=(1<<pin);
			break;
		default:
			break;
	}
}

unsigned int ReadPin(char port, unsigned int pin)
{
	switch(port)
	{
		case 'A': return (GPIOA_IDR>>pin) & 1;
		case 'B': return (GPIOB_IDR>>pin) & 1;
		case 'C': return (GPIOC_IDR>>pin) & 1;
		case 'D': return (GPIOD_IDR>>pin) & 1;
		case 'E': return (GPIOE_IDR>>pin) & 1;
		case 'F': return (GPIOF_IDR>>pin) & 1;
		case 'G': return (GPIOG_IDR>>pin) & 1;
		case 'H': return (GPIOH_IDR>>pin) & 1;
		case 'I': return (GPIOI_IDR>>pin) & 1;
		default: return 0;
	}
}

unsigned int GetSYSCLKFreq(void)
{
	unsigned int freq;

	switch((RCC_CFGR>>2) & 3)
	{
		case 0:	//HSI
			freq=16000000;
		break;
		case 1:	//HSE
			freq=HSEfreq;
		break;
		case 2:	//PLL
			if(((RCC_PLLCFGR>>22) & 1)==0){ freq=16000000; }else{ freq=HSEfreq; }	//PLL input=HSI or HSE
			freq /= RCC_PLLCFGR & 0x3F;	//M
			freq *= (RCC_PLLCFGR>>6) & 0x1FF;	//N
			freq /= (((RCC_PLLCFGR>>16) & 3)+1)<<1;	//P
		break;
	}
	
	return freq;
}

unsigned int GetAHBFreq(void)
{
	unsigned int freq,div;
	
	freq=GetSYSCLKFreq();
	div=(RCC_CFGR>>4) & 0xF;
	if((div & 8)!=0)	//if SYSCLK divided
	{
		div &= 7;
		if(div<=3){ div=1<<(div+1); }else{ div=1<<(div+2); }
		freq /= div;
	}
	
	return freq;
}

unsigned int GetAPB1Freq(void)
{
	unsigned int freq,div;
	
	freq=GetAHBFreq();
	div=(RCC_CFGR>>10) & 7;
	if((div & 4)!=0)	//if AHBCLK divided
	{
		div &= 3;
		div=1<<(div+1);
		freq /= div;
	}
	
	return freq;
}

unsigned int GetAPB2Freq(void)
{
	unsigned int freq,div;
	
	freq=GetAHBFreq();
	div=(RCC_CFGR>>13) & 7;
	if((div & 4)!=0)	//if AHBCLK divided
	{
		div &= 3;
		div=1<<(div+1);
		freq /= div;
	}
	
	return freq;
}

void SetAF(volatile unsigned int *GPIO_AFRL, volatile unsigned int *GPIO_AFRH, unsigned int pin, unsigned int AFnum)
{
	if(pin<=7)
	{
		*GPIO_AFRL &= ~(0xFUL<<(pin<<2));	//clear configuration bits
		*GPIO_AFRL |= AFnum<<(pin<<2);
	}else
	{
		*GPIO_AFRH &= ~(0xFUL<<((pin-8)<<2));	//clear configuration bits
		*GPIO_AFRH |= AFnum<<((pin-8)<<2);
	}
}

void SetAFA(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1;													//GPIOAEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOA_AFRL,(unsigned int *)&GPIOA_AFRH, pin, AFnum);
}

void SetAFB(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<1;													//GPIOBEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOB_AFRL,(unsigned int *)&GPIOB_AFRH, pin, AFnum);
}

