bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
void SetAFC(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<2;													//GPIOCEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOC_AFRL,(unsigned int *)&GPIOC_AFRH, pin, AFnum);
}

void SetAFD(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<3;													//GPIODEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOD_AFRL,(unsigned int *)&GPIOD_AFRH, pin, AFnum);
}

void SetAFE(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<4;													//GPIOEEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOE_AFRL,(unsigned int *)&GPIOE_AFRH, pin, AFnum);
}

void SetAFF(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<5;													//GPIOFEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOF_AFRL,(unsigned int *)&GPIOF_AFRH, pin, AFnum);
}

void SetAFG(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<6;													//GPIOGEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOG_AFRL,(unsigned int *)&GPIOG_AFRH, pin, AFnum);
}

void SetAFH(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<7;													//GPIOHEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOH_AFRL,(unsigned int *)&GPIOH_AFRH, pin, AFnum);
}

void SetAFI(unsigned int pin, unsigned int AFnum)
{
	RCC_AHB1ENR |= 1UL<<8;													//GPIOIEN clock enable, allows port configuration registers to be edited
	SetAF((unsigned int *)&GPIOI_AFRL,(unsigned int *)&GPIOI_AFRH, pin, AFnum);
}

void InitUSART(unsigned int baud, volatile unsigned int *USART_BRR, volatile unsigned int *USART_CR1, volatile unsigned int *USART_CR2, volatile unsigned int *USART_CR3, volatile unsigned int *USART_SR)
{
	*USART_CR1 = 1UL<<13;											// Enable USART
	
	if(((unsigned int)USART_BRR==(unsigned int)&USART1_BRR) || ((unsigned int)USART_BRR==(unsigned int)&USART6_BRR))		//check if it is USART1 or USART6, if it is use APB2 frequency, else APB1
	{
		*USART_BRR = (GetAPB2Freq() / baud);
	}else
	{
		*USART_BRR = (GetAPB1Freq() / baud);
	}
	
	//8N1 is default
	*USART_CR1 |= 1UL<<3;											// Enable transmitter
	*USART_CR1 |= 1UL<<2;											// Enable receiver
	*USART_CR1 |= 1UL<<1;											// Receiver in active mode
	
	*USART_CR2=0;
	*USART_CR3=0;
	
	while((*USART_SR & (1UL<<6)) == 0);				// Wait for USART to be ready
}

void WriteUSART(unsigned char chrval, volatile unsigned int *USART_SR, volatile unsigned int *USART_DR)
{
	//a read from the USART_SR register followed by a write to the USART_DR register clears the transmission complete bit (6)
	while((*USART_SR & (1UL<<6)) == 0);							// Wait for transmission to complete
	*USART_DR = chrval;
	while((*USART_SR & (1UL<<7)) == 0);							// Wait for data to enter the shift register (cleared by a write to DR)
}

unsigned char ReadUSART(volatile unsigned int *USART_SR, volatile unsigned int *USART_DR)
{
	while((*USART_SR & (1UL<<5)) == 0);							// wait for Received data is ready to be read (cleared by reading data register)
	return *USART_DR;
}

unsigned int USARTDataIsAvailable(volatile unsigned int *USART_SR)	// Return 1 if a byte is in the buffer
{
	return (*USART_SR>>5) & 1;
}

void InitUSART1(unsigned int baud)
{
	RCC_APB2ENR |= 1<<4;										// USART1 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFA(9,AF_USART1_TX);	//PA9 AF USART1_TX
	SetAFA(10,AF_USART1_RX);	//PA10 AF USART1_RX
	ConfigPortA("---- -rr- ---- ----");			// sets PA9 and PA10 to alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&USART1_BRR, (unsigned int *)&USART1_CR1, (unsigned int *)&USART1_CR2, (unsigned int *)&USART1_CR3, (unsigned int *)&USART1_SR);
}

void InitUSART1Interrupts(unsigned int baud)
{
	InitUSART1(baud);
	EnableInterruptPosition(USART1_Interrupt_Position);
	USART1_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUSART1(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&USART1_SR, (unsigned int *)&USART1_DR);
}

unsigned char ReadUSART1(void)
{
	return ReadUSART((unsigned int *)&USART1_SR, (unsigned int *)&USART1_DR);
}

unsigned int USART1DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&USART1_SR);
}

void InitUSART2(unsigned int baud)
{
	RCC_APB1ENR |= 1<<17;										// USART2 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFA(2,AF_USART2_TX);	//PA2 AF USART2_TX
	SetAFA(3,AF_USART2_RX);	//PA3 AF USART2_RX
	ConfigPortA("---- ---- ---- rr--");			// sets PA2 and PA3 to alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&USART2_BRR, (unsigned int *)&USART2_CR1, (unsigned int *)&USART2_CR2, (unsigned int *)&USART2_CR3, (unsigned int *)&USART2_SR);
}

void InitUSART2Interrupts(unsigned int baud)
{
	InitUSART2(baud);
	EnableInterruptPosition(USART2_Interrupt_Position);
	USART2_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUSART2(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&USART2_SR, (unsigned int *)&USART2_DR);
}

unsigned char ReadUSART2(void)
{
	return ReadUSART((unsigned int *)&USART2_SR, (unsigned int *)&USART2_DR);
}

unsigned int USART2DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&USART2_SR);
}

void InitUSART3(unsigned int baud)
{
	RCC_APB1ENR |= 1<<18;										// USART3 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFB(10,AF_USART3_TX);	//PB3 AF USART3_TX
	SetAFB(11,AF_USART3_RX);	//PB3 AF USART3_RX
	ConfigPortB("---- rr-- ---- ----");			// sets PB10 and PB11 to alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&USART3_BRR, (unsigned int *)&USART3_CR1, (unsigned int *)&USART3_CR2, (unsigned int *)&USART3_CR3, (unsigned int *)&USART3_SR);
}

void InitUSART3Interrupts(unsigned int baud)
{
	InitUSART3(baud);
	EnableInterruptPosition(USART3_Interrupt_Position);
	USART3_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUSART3(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&USART3_SR, (unsigned int *)&USART3_DR);
}

