bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
unsigned char ReadUSART3(void)
{
	return ReadUSART((unsigned int *)&USART3_SR, (unsigned int *)&USART3_DR);
}

unsigned int USART3DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&USART3_SR);
}

void InitUART4(unsigned int baud)
{
	RCC_APB1ENR |= 1<<19;										// UART4 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFA(0,AF_UART4_TX);	//PA0 AF UART4_TX
	SetAFA(1,AF_UART4_RX);	//PA1 AF UART4_RX
	ConfigPortA("---- ---- ---- --rr");			// sets PA0 and PA1 to alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&UART4_BRR, (unsigned int *)&UART4_CR1, (unsigned int *)&UART4_CR2, (unsigned int *)&UART4_CR3, (unsigned int *)&UART4_SR);
}

void InitUART4Interrupts(unsigned int baud)
{
	InitUART4(baud);
	EnableInterruptPosition(UART4_Interrupt_Position);
	UART4_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUART4(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&UART4_SR, (unsigned int *)&UART4_DR);
}

unsigned char ReadUART4(void)
{
	return ReadUSART((unsigned int *)&UART4_SR, (unsigned int *)&UART4_DR);
}

unsigned int UART4DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&UART4_SR);
}

void InitUART5(unsigned int baud)
{
	RCC_APB1ENR |= 1<<20;										// UART5 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFC(12,AF_UART5_TX);	//PC12 AF UART5_TX
	SetAFD(2,AF_UART5_RX);	//PD2 AF UART5_RX
	ConfigPortC("---r ---- ---- ----");			// sets PC12 alternate function 25Mhz push pull
	ConfigPortD("---- ---- ---- -r--");			// sets PD2 alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&UART5_BRR, (unsigned int *)&UART5_CR1, (unsigned int *)&UART5_CR2, (unsigned int *)&UART5_CR3, (unsigned int *)&UART5_SR);
}

void InitUART5Interrupts(unsigned int baud)
{
	InitUART5(baud);
	EnableInterruptPosition(UART5_Interrupt_Position);
	UART5_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUART5(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&UART5_SR, (unsigned int *)&UART5_DR);
}

unsigned char ReadUART5(void)
{
	return ReadUSART((unsigned int *)&UART5_SR, (unsigned int *)&UART5_DR);
}

unsigned int UART5DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&UART5_SR);
}

void InitUSART6(unsigned int baud)
{
	RCC_APB2ENR |= 1<<5;										// USART6 clock enable
	//configure AF first so RX and TX dont both end up as output
	SetAFC(6,AF_USART6_TX);	//PC6 AF USART3_TX
	SetAFC(7,AF_USART6_RX);	//PC7 AF USART3_RX
	ConfigPortC("---- ---- rr-- ----");			// sets PC6 and PC7 to alternate function 25Mhz push pull

	InitUSART(baud, (unsigned int *)&USART6_BRR, (unsigned int *)&USART6_CR1, (unsigned int *)&USART6_CR2, (unsigned int *)&USART6_CR3, (unsigned int *)&USART6_SR);
}

void InitUSART6Interrupts(unsigned int baud)
{
	InitUSART6(baud);
	EnableInterruptPosition(USART6_Interrupt_Position);
	USART6_CR1 |= 1<<5;	//interrupt enable for when read data register not empty
}

void WriteUSART6(unsigned char chrval)
{
	WriteUSART(chrval, (unsigned int *)&USART6_SR, (unsigned int *)&USART6_DR);
}

unsigned char ReadUSART6(void)
{
	return ReadUSART((unsigned int *)&USART6_SR, (unsigned int *)&USART6_DR);
}

unsigned int USART6DataIsAvailable(void)	// Return 1 if a character is in the buffer
{
	return USARTDataIsAvailable((unsigned int *)&USART6_SR);
}

void InitRandomNumberGenerator(void)
{
	RCC_AHB2ENR |= 1UL<<6;	//Random number generator clock enable
	RNG_CR |= 1UL<<2; //enable the generator
}

unsigned int ReadRandomNumberGenerator(void)
{
	unsigned int count=0, count2=0, rnd;
	
	do
	{
		count2 += 1;
		if(count>1)
		{
			RNG_CR &= ~(1UL<<2); //disable the generator
			RNG_SR &= ~(1UL<<6); //clear the seed error
			RNG_CR |= 1UL<<2; //enable the generator
		}	
		
		do
		{
			count += 1;
			if(count>1){  RNG_SR &= ~(1UL<<5); }	//if a retry, clear the clock error
			while((RNG_SR & 1)==0);	//wait for a value to be ready
			rnd=RNG_DR;
		}while(((RNG_SR>>5) & 1)==1);	//loop if there is a clock error
	}while(((RNG_SR>>6) & 1)==1); //loop if seed error
	
	return rnd;
}

void InitDAC(unsigned int mode, unsigned int BufferEN)
{
	RCC_APB1ENR |= 1<<29;	//enable DAC clock
	DAC_CR=0;
	
	if(mode>DAC_Stereo){ mode=DAC_Mono1; }	//if invalid mode, use mono1
	switch(mode)
	{
		case DAC_Mono1:
			ConfigPortA("---- ---- ---a ----");	//analog mode
			DAC_CR |= 1<<2;	//DAC channel1 trigger enabled
			DAC_CR |= 7<<3;	//DAC channel1 Software trigger
			if(BufferEN==DAC_Unbuffered){ DAC_CR |= 1<<1; }	//channel1 output buffer disabled
			DAC_CR |= 1;	//DAC channel1 enable	
		break;
			
		case DAC_Mono2:
			ConfigPortA("---- ---- --a- ----");	//analog mode
			DAC_CR |= 1<<18;	//DAC channel2 trigger enabled
			DAC_CR |= 7<<19;	//DAC channel2 Software trigger
			if(BufferEN==DAC_Unbuffered){ DAC_CR |= 1<<17; }	//channel2 output buffer disabled
			DAC_CR |= 1<<16;	//DAC channel2 enable
		break;
			
		case DAC_Stereo:
			ConfigPortA("---- ---- --aa ----");	//analog mode
			DAC_CR |= 1<<2;	//DAC channel1 trigger enabled
			DAC_CR |= 7<<3;	//DAC channel1 Software trigger
			if(BufferEN==DAC_Unbuffered){ DAC_CR |= 1<<1; }	//channel1 output buffer disabled
			DAC_CR |= 1;	//DAC channel1 enable	
		
			DAC_CR |= 1<<18;	//DAC channel2 trigger enabled
			DAC_CR |= 7<<19;	//DAC channel2 Software trigger
			if(BufferEN==DAC_Unbuffered){ DAC_CR |= 1<<17; }	//channel2 output buffer disabled
			DAC_CR |= 1<<16;	//DAC channel2 enable
		break;
	}
}

void SetDAC1(unsigned int DACval)	//12 bit 0-4095
{
	//while((DAC_SWTRIGR & 1)==1);	//wait for ready
	DAC_DHR12R1=DACval;
	DAC_SWTRIGR |= 1;	//DAC channel1 software trigger
}

void SetDAC2(unsigned int DACval)	//12 bit 0-4095
{
	//while((DAC_SWTRIGR & 2)==2);	//wait for ready
	DAC_DHR12R2=DACval;
	DAC_SWTRIGR |= 2;	//DAC channel2 software trigger
}

void SetDACStereo(unsigned int DACval1, unsigned int DACval2)	//12 bit 0-4095
{
	//while((DAC_SWTRIGR & 3)!=0);	//wait for ready
	DAC_DHR12RD=DACval1 | (DACval2<<16);
	DAC_SWTRIGR |= 3;	//DAC channel 1 and 2 software trigger
}
/*
Channel	ADC1	ADC2	ADC3
0				PA0		PA0		PA0
1				PA1		PA1		PA1
2				PA2		PA2		PA2
3				PA3		PA3		PA3
4				PA4		PA4	
5				PA5		PA5	
6				PA6		PA6	
7				PA7		PA7	
8				PB0		PB0	
9				PB1		PB1	
10			PC0		PC0		PC0
11			PC1		PC1		PC1
12			PC2		PC2		PC2
13			PC3		PC3		PC3
14			PC4		PC4	
15			PC5		PC5	
16			temperature sensor		
17			VREFINT		
18			VBAT/2
*/

void InitADC1(unsigned int channels, unsigned int resolution, unsigned int SamplingTime)	//each bit represents a channel, LSB=channel 0
{
	unsigned int APBfreq, i;
	
	RCC_APB2ENR |= 1UL<<8;
	
	ADC_CCR=0;
	ADC1_CR1=0;
	ADC1_SQR1=0;
	
