bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
	if((channels & 1)!=0){ ConfigPortA("---- ----  ---- ---a"); }
	if((channels & 1UL<<1)!=0){ ConfigPortA("---- ----  ---- --a-"); }
	if((channels & 1UL<<2)!=0){ ConfigPortA("---- ----  ---- -a--"); }
	if((channels & 1UL<<3)!=0){ ConfigPortA("---- ----  ---- a---"); }
	if((channels & 1UL<<4)!=0){ ConfigPortA("---- ----  ---a ----"); }
	if((channels & 1UL<<5)!=0){ ConfigPortA("---- ----  --a- ----"); }
	if((channels & 1UL<<6)!=0){ ConfigPortA("---- ----  -a-- ----"); }
	if((channels & 1UL<<7)!=0){ ConfigPortA("---- ----  a--- ----"); }
	if((channels & 1UL<<8)!=0){ ConfigPortB("---- ----  ---- ---a"); }
	if((channels & 1UL<<9)!=0){ ConfigPortB("---- ----  ---- --a-"); }
	if((channels & 1UL<<10)!=0){ ConfigPortC("---- ----  ---- ---a"); }
	if((channels & 1UL<<11)!=0){ ConfigPortC("---- ----  ---- --a-"); }
	if((channels & 1UL<<12)!=0){ ConfigPortC("---- ----  ---- -a--"); }
	if((channels & 1UL<<13)!=0){ ConfigPortC("---- ----  ---- a---"); }
	if((channels & 1UL<<14)!=0){ ConfigPortC("---- ----  ---a ----"); }
	if((channels & 1UL<<15)!=0){ ConfigPortC("---- ----  --a- ----"); }
	if((channels & 1UL<<16)!=0){ ADC_CCR |= 1UL<<23; }	//temperature sensor (and VREFINT enabled)
	if((channels & 1UL<<17)!=0){ ADC_CCR |= 1UL<<23; }	//VREFINT enabled (and temperature sensor)
	if((channels & 1UL<<18)!=0){ ADC_CCR |= 1UL<<22; }	//VBAT/2 enabled

	APBfreq=GetAPB2Freq();
	for(i=0;i<=3;i++)
	{
		if(APBfreq/((i+1)<<1)>=18000000)	//prescaler (/2, /4, /6, /8) for 18Mhz Max
		{
			ADC_CCR |= i<<16;
			break;
		}
	}
	
	ADC1_CR1 |= resolution<<24;
	ADC1_SMPR2=SamplingTime;
	ADC1_CR2 |= 1; //Enable ADC
}

void InitADC2(unsigned int channels, unsigned int resolution, unsigned int SamplingTime)	//each bit represents a channel, LSB=channel 0
{
	unsigned int APBfreq, i;
	
	RCC_APB2ENR |= 1UL<<9;
	
	ADC_CCR=0;
	ADC2_CR1=0;
	ADC2_SQR1=0;
	
	if((channels & 1)!=0){ ConfigPortA("---- ----  ---- ---a"); }
	if((channels & 1UL<<1)!=0){ ConfigPortA("---- ----  ---- --a-"); }
	if((channels & 1UL<<2)!=0){ ConfigPortA("---- ----  ---- -a--"); }
	if((channels & 1UL<<3)!=0){ ConfigPortA("---- ----  ---- a---"); }
	if((channels & 1UL<<4)!=0){ ConfigPortA("---- ----  ---a ----"); }
	if((channels & 1UL<<5)!=0){ ConfigPortA("---- ----  --a- ----"); }
	if((channels & 1UL<<6)!=0){ ConfigPortA("---- ----  -a-- ----"); }
	if((channels & 1UL<<7)!=0){ ConfigPortA("---- ----  a--- ----"); }
	if((channels & 1UL<<8)!=0){ ConfigPortB("---- ----  ---- ---a"); }
	if((channels & 1UL<<9)!=0){ ConfigPortB("---- ----  ---- --a-"); }
	if((channels & 1UL<<10)!=0){ ConfigPortC("---- ----  ---- ---a"); }
	if((channels & 1UL<<11)!=0){ ConfigPortC("---- ----  ---- --a-"); }
	if((channels & 1UL<<12)!=0){ ConfigPortC("---- ----  ---- -a--"); }
	if((channels & 1UL<<13)!=0){ ConfigPortC("---- ----  ---- a---"); }
	if((channels & 1UL<<14)!=0){ ConfigPortC("---- ----  ---a ----"); }
	if((channels & 1UL<<15)!=0){ ConfigPortC("---- ----  --a- ----"); }
	
	APBfreq=GetAPB2Freq();
	for(i=0;i<=3;i++)
	{
		if(APBfreq/((i+1)<<1)>=18000000)	//prescaler (/2, /4, /6, /8) for 18Mhz Max
		{
			ADC_CCR |= i<<16;
			break;
		}
	}
	
	ADC2_CR1 |= resolution<<24;
	ADC2_SMPR2=SamplingTime;
	ADC2_CR2 |= 1; //Enable ADC
}

void InitADC3(unsigned int channels, unsigned int resolution, unsigned int SamplingTime)	//each bit represents a channel, LSB=channel 0
{
	unsigned int APBfreq, i;
	
	RCC_APB2ENR |= 1UL<<10;
	
	ADC_CCR=0;
	ADC3_CR1=0;
	ADC3_SQR1=0;
	
	if((channels & 1)!=0){ ConfigPortA("---- ----  ---- ---a"); }
	if((channels & 1UL<<1)!=0){ ConfigPortA("---- ----  ---- --a-"); }
	if((channels & 1UL<<2)!=0){ ConfigPortA("---- ----  ---- -a--"); }
	if((channels & 1UL<<3)!=0){ ConfigPortA("---- ----  ---- a---"); }
	if((channels & 1UL<<4)!=0){ ConfigPortF("---- ----  -a-- ----"); }
	if((channels & 1UL<<5)!=0){ ConfigPortF("---- ----  a--- ----"); }
	if((channels & 1UL<<6)!=0){ ConfigPortF("---- ---a  ---- ----"); }
	if((channels & 1UL<<7)!=0){ ConfigPortF("---- --a-  ---- ----"); }
	if((channels & 1UL<<8)!=0){ ConfigPortF("---- -a--  ---- ----"); }
	if((channels & 1UL<<9)!=0){ ConfigPortF("---- ----  ---- a---"); }
	if((channels & 1UL<<10)!=0){ ConfigPortC("---- ----  ---- ---a"); }
	if((channels & 1UL<<11)!=0){ ConfigPortC("---- ----  ---- --a-"); }
	if((channels & 1UL<<12)!=0){ ConfigPortC("---- ----  ---- -a--"); }
	if((channels & 1UL<<13)!=0){ ConfigPortC("---- ----  ---- a---"); }
	if((channels & 1UL<<14)!=0){ ConfigPortF("---- ----  ---a ----"); }
	if((channels & 1UL<<15)!=0){ ConfigPortF("---- ----  --a- ----"); }

	APBfreq=GetAPB2Freq();
	for(i=0;i<=3;i++)
	{
		if(APBfreq/((i+1)<<1)>=18000000)	//prescaler (/2, /4, /6, /8) for 18Mhz Max
		{
			ADC_CCR |= i<<16;
			break;
		}
	}
	
	ADC3_CR1 |= resolution<<24;
	ADC3_SMPR2=SamplingTime;
	ADC3_CR2 |= 1; //Enable ADC
}

unsigned int ReadADC1(unsigned int channel)
{
	ADC1_SQR3=channel;
	ADC1_CR2 |= 1UL<<30;	//start conversion
	while((ADC1_SR & (1UL<<1))==0);	//wait for end of conversion
	return ADC1_DR;	//also clears end of conversion bit
}

unsigned int ReadADC2(unsigned int channel)
{
	ADC2_SQR3=channel;
	ADC2_CR2 |= 1UL<<30;	//start conversion
	while((ADC2_SR & (1UL<<1))==0);	//wait for end of conversion
	return ADC2_DR;	//also clears end of conversion bit
}

unsigned int ReadADC3(unsigned int channel)
{
	ADC3_SQR3=channel;
	ADC3_CR2 |= 1UL<<30;	//start conversion
	while((ADC3_SR & (1UL<<1))==0);	//wait for end of conversion
	return ADC3_DR;	//also clears end of conversion bit
}

//interrupts
void EnableInterruptPosition(unsigned int InterruptPosition)
{
	switch(InterruptPosition>>5)	// div by 32 (96 bits (positions) in 3 registers)
	{
		case 0:
				NVIC_ISER0 |= 1<<InterruptPosition;	//enable timer interrupt position
		break;
		case 1:
				NVIC_ISER1 |= 1<<(InterruptPosition-32);	//enable timer interrupt position
		break;
		case 2:
				NVIC_ISER2 |= 1<<(InterruptPosition-64);	//enable timer interrupt position
		break;
	}
}

void DisableInterruptPosition(unsigned int InterruptPosition)
{
	switch(InterruptPosition>>5)	// div by 32 (96 bits (positions) in 3 registers)
	{
		case 0:
				NVIC_ISER0 &= ~(1<<InterruptPosition);	//enable timer interrupt position
		break;
		case 1:
				NVIC_ISER1 &= ~(1<<(InterruptPosition-32));	//enable timer interrupt position
		break;
		case 2:
				NVIC_ISER2 &= ~(1<<(InterruptPosition-64));	//enable timer interrupt position
		break;
	}
}

//timer
void StartTimer(unsigned int prescaler, volatile unsigned int *TIM_CR1, volatile unsigned int *TIM_PSC)	//timer runs at twice the APBx bus speed when bus divider>1. pescaler is 16 bit, and must be between 0 and 0xFFFF CK_CNT=fCK_PSC/(prescaler+1)
{	
	*TIM_CR1 &= ~(3<<8);	//no clock division, tDTS = tCK_INT
	*TIM_CR1 |= 1<<7;			//Auto-reload preload enable: TIMx_ARR register is buffered (updated only at end of period)
	*TIM_CR1 &= ~(3<<5);	//Edge-aligned mode. The counter counts up or down depending on the direction bit (DIR).
	*TIM_CR1 &= ~(1<<4);	//Counter used as upcounter
	*TIM_CR1 &= ~(1<<3);	//Counter is not stopped at update event
	*TIM_CR1 &= ~(1<<1);	//UEV enabled. The Update (UEV) event is generated by one of the following events: Counter overflow/underflow, Setting the UG bit, Update generation through the slave mode controller. Buffered registers are then loaded with their preload values.
	*TIM_PSC=prescaler;		//prescaler
	*TIM_CR1 |= 1;			//counter enabled
}

unsigned int ReadAndResetTimerOverflow(volatile unsigned int *TIM_SR)
{
	unsigned int overflow=*TIM_SR & 1;	//read flag

	if(overflow){ *TIM_SR &= ~1; }	//reset flag
	return overflow;
}

