bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
void StartTimer2(unsigned int prescaler)
{
	RCC_APB1ENR |= 1;		//timer 2 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM2_CR1, (unsigned int *)&TIM2_PSC);
	TIM2_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer2(void)
{
	return TIM2_CNT;
}

void ResetTimer2(void)
{
	TIM2_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM2_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow2(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM2_SR);
}

void StartTimer5(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<3;		//timer 5 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM5_CR1, (unsigned int *)&TIM5_PSC);
	TIM5_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer5(void)
{
	return TIM5_CNT;
}

void ResetTimer5(void)
{
	TIM5_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM5_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow5(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM5_SR);
}

void StartTimer3(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<1;		//timer 3 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM3_CR1, (unsigned int *)&TIM3_PSC);
	TIM3_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer3(void)
{
	return TIM3_CNT;
}

void ResetTimer3(void)
{
	TIM3_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM3_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow3(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM3_SR);
}

void StartTimer4(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<2;		//timer 4 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM4_CR1, (unsigned int *)&TIM4_PSC);
	TIM4_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer4(void)
{
	return TIM4_CNT;
}

void ResetTimer4(void)
{
	TIM4_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM4_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow4(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM4_SR);
}




void StartTimer9(unsigned int prescaler)
{
	RCC_APB2ENR |= 1<<16;		//timer 9 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM9_CR1, (unsigned int *)&TIM9_PSC);
	TIM4_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer9(void)
{
	return TIM9_CNT;
}

void ResetTimer9(void)
{
	TIM9_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM9_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow9(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM9_SR);
}

void StartTimer10(unsigned int prescaler)
{
	RCC_APB2ENR |= 1<<17;		//timer 10 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM10_CR1, (unsigned int *)&TIM10_PSC);
	TIM10_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer10(void)
{
	return TIM10_CNT;
}

void ResetTimer10(void)
{
	TIM10_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM10_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow10(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM10_SR);
}

void StartTimer11(unsigned int prescaler)
{
	RCC_APB2ENR |= 1<<18;		//timer 11 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM11_CR1, (unsigned int *)&TIM11_PSC);
	TIM11_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer11(void)
{
	return TIM11_CNT;
}

void ResetTimer11(void)
{
	TIM11_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM11_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow11(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM11_SR);
}

void StartTimer12(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<6;		//timer 12 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM12_CR1, (unsigned int *)&TIM12_PSC);
	TIM10_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer12(void)
{
	return TIM12_CNT;
}

void ResetTimer12(void)
{
	TIM12_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM12_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow12(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM12_SR);
}

void StartTimer13(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<7;		//timer 13 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM13_CR1, (unsigned int *)&TIM13_PSC);
	TIM13_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer13(void)
{
	return TIM13_CNT;
}

void ResetTimer13(void)
{
	TIM13_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM13_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow13(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM13_SR);
}

void StartTimer14(unsigned int prescaler)
{
	RCC_APB1ENR |= 1<<8;		//timer 14 clock enable
	StartTimer(prescaler, (unsigned int *)&TIM14_CR1, (unsigned int *)&TIM14_PSC);
	TIM14_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
}

unsigned int ReadTimer14(void)
{
	return TIM14_CNT;
}

void ResetTimer14(void)
{
	TIM14_EGR |= 1;	//Re-initialize the counter and generates an update of the registers. Note that the prescaler counter is cleared too
	while((TIM14_EGR & 1) != 0);
}

unsigned int ReadAndResetTimerOverflow14(void)
{
	return ReadAndResetTimerOverflow((unsigned int *)&TIM14_SR);
}

unsigned int GetTimer2InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer5InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer3InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer4InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer9InputClockFreq(void)
{
	if(((RCC_CFGR>>15) & 1)==0){ return GetAPB2Freq(); }else{ return GetAPB2Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

