bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
unsigned int GetTimer10InputClockFreq(void)
{
	if(((RCC_CFGR>>15) & 1)==0){ return GetAPB2Freq(); }else{ return GetAPB2Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer11InputClockFreq(void)
{
	if(((RCC_CFGR>>15) & 1)==0){ return GetAPB2Freq(); }else{ return GetAPB2Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer12InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer13InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer14InputClockFreq(void)
{
	if(((RCC_CFGR>>12) & 1)==0){ return GetAPB1Freq(); }else{ return GetAPB1Freq()*2; }	//if APBx prescaler is not divided, fAPBx else 2*fAPBs
}

unsigned int GetTimer2Freq(void){ return GetTimer2InputClockFreq()/(TIM2_PSC+1); }
unsigned int GetTimer5Freq(void){ return GetTimer2InputClockFreq()/(TIM5_PSC+1); }
unsigned int GetTimer3Freq(void){ return GetTimer2InputClockFreq()/(TIM3_PSC+1); }
unsigned int GetTimer4Freq(void){ return GetTimer2InputClockFreq()/(TIM4_PSC+1); }
unsigned int GetTimer9Freq(void){ return GetTimer2InputClockFreq()/(TIM9_PSC+1); }
unsigned int GetTimer10Freq(void){ return GetTimer2InputClockFreq()/(TIM10_PSC+1); }
unsigned int GetTimer11Freq(void){ return GetTimer2InputClockFreq()/(TIM11_PSC+1); }
unsigned int GetTimer12Freq(void){ return GetTimer2InputClockFreq()/(TIM12_PSC+1); }
unsigned int GetTimer13Freq(void){ return GetTimer2InputClockFreq()/(TIM13_PSC+1); }
unsigned int GetTimer14Freq(void){ return GetTimer2InputClockFreq()/(TIM14_PSC+1); }

void StartTimerInterrupt(unsigned int TimerPrescaler, unsigned int CountPeriod, volatile unsigned int *TIM_CR1, volatile unsigned int *TIM_PSC, volatile unsigned int *TIM_ARR, volatile unsigned int *TIM_DIER, volatile unsigned int *TIM_EGR, unsigned int InterruptPosition)
{	
	*TIM_CR1 &= ~(3<<8);	//no clock division, tDTS = tCK_INT
	*TIM_CR1 |= 1<<7;			//Auto-reload preload enable: TIMx_ARR register is buffered (updated only at end of period)
	*TIM_CR1 &= ~(3<<5);	//Edge-aligned mode. The counter counts up or down depending on the direction bit (DIR).
	*TIM_CR1 &= ~(1<<4);	//Counter used as upcounter
	*TIM_CR1 &= ~(1<<3);	//Counter is not stopped at update event
	*TIM_CR1 &= ~(1<<1);	//UEV enabled. The Update (UEV) event is generated by one of the following events: Counter overflow/underflow, Setting the UG bit, Update generation through the slave mode controller. Buffered registers are then loaded with their preload values.
	*TIM_PSC=TimerPrescaler;		//prescaler
	
	*TIM_ARR=CountPeriod;	//period
	*TIM_DIER |= 1;				//Update interrupt enabled
	*TIM_EGR |= 1;				//Re-initialize the counter and generates an update of the registers
	while((*TIM_EGR & 1) != 0);
	
	EnableInterruptPosition(InterruptPosition);
	
	*TIM_CR1 |= 1;				//counter enabled
}

void StartTimer2InterruptPosition(unsigned int TimerPrescaler, unsigned int CountPeriod)
{
	RCC_APB1ENR |= 1;		//timer 2 clock enable
	StartTimerInterrupt(TimerPrescaler, CountPeriod, (unsigned int *)&TIM2_CR1, (unsigned int *)&TIM2_PSC, (unsigned int *)&TIM2_ARR, (unsigned int *)&TIM2_DIER, (unsigned int *)&TIM2_EGR, TIM2_Interrupt_Position);
}

void StartTimer5InterruptPosition(unsigned int TimerPrescaler, unsigned int CountPeriod)
{
	RCC_APB1ENR |= 1<<3;		//timer 5 clock enable
	StartTimerInterrupt(TimerPrescaler, CountPeriod, (unsigned int *)&TIM5_CR1, (unsigned int *)&TIM5_PSC, (unsigned int *)&TIM5_ARR, (unsigned int *)&TIM5_DIER, (unsigned int *)&TIM5_EGR, TIM5_Interrupt_Position);
}

void StartTimer3InterruptPosition(unsigned int TimerPrescaler, unsigned int CountPeriod)
{
	RCC_APB1ENR |= 1<<1;		//timer 3 clock enable
	StartTimerInterrupt(TimerPrescaler, CountPeriod, (unsigned int *)&TIM3_CR1, (unsigned int *)&TIM3_PSC, (unsigned int *)&TIM3_ARR, (unsigned int *)&TIM3_DIER, (unsigned int *)&TIM3_EGR, TIM3_Interrupt_Position);
}

void StartTimer4InterruptPosition(unsigned int TimerPrescaler, unsigned int CountPeriod)
{
	RCC_APB1ENR |= 1<<2;		//timer 4 clock enable
	StartTimerInterrupt(TimerPrescaler, CountPeriod, (unsigned int *)&TIM4_CR1, (unsigned int *)&TIM4_PSC, (unsigned int *)&TIM4_ARR, (unsigned int *)&TIM4_DIER, (unsigned int *)&TIM4_EGR, TIM4_Interrupt_Position);
}

//capture
void InitCapture(unsigned int CaptureChannel, volatile unsigned int *TIM_CCMR1, volatile unsigned int *TIM_CCMR2, volatile unsigned int *TIM_CCER, unsigned int filter, unsigned int edge, unsigned int edgeprescaler)
{
	switch(CaptureChannel)
	{
		case Capture_Channel1:
			//filter
			*TIM_CCMR1 &= ~(0xF<<4);
			*TIM_CCMR1 |= filter<<4;
		
			//prescaler
			*TIM_CCMR1 &= ~(3<<2);
			*TIM_CCMR1 |= edgeprescaler<<2;
		
			//mapping to TI1
			*TIM_CCMR1 &= ~3;
			*TIM_CCMR1 |= 1;
		break;
		case Capture_Channel2:
			//filter
			*TIM_CCMR1 &= ~(0xF<<12);
			*TIM_CCMR1 |= filter<<12;
		
			//prescaler
			*TIM_CCMR1 &= ~(3<<10);
			*TIM_CCMR1 |= edgeprescaler<<10;
		
			//mapping to TI2
			*TIM_CCMR1 &= ~(3<<8);
			*TIM_CCMR1 |= 1<<8;
		break;
		case Capture_Channel3:
			//filter
			*TIM_CCMR2 &= ~(0xF<<4);
			*TIM_CCMR2 |= filter<<4;
		
			//prescaler
			*TIM_CCMR2 &= ~(3<<2);
			*TIM_CCMR2 |= edgeprescaler<<2;
		
			//mapping to TI3
			*TIM_CCMR2 &= ~3;
			*TIM_CCMR2 |= 1;
		break;
		case Capture_Channel4:
			//filter
			*TIM_CCMR2 &= ~(0xF<<12);
			*TIM_CCMR2 |= filter<<12;
		
			//prescaler
			*TIM_CCMR2 &= ~(3<<10);
			*TIM_CCMR2 |= edgeprescaler<<10;
		
			//mapping to TI4
			*TIM_CCMR2 &= ~(3<<8);
			*TIM_CCMR2 |= 1<<8;
		break;
	}

	switch(edge)
	{
		case Capture_Rising_Edge:
			*TIM_CCER &= ~(((1<<3) | (1<<1))<<((CaptureChannel-1)*4));
		break;
		case Capture_Falling_Edge:
			*TIM_CCER &= ~((1<<3)<<((CaptureChannel-1)*4));
			*TIM_CCER |= (1<<1)<<((CaptureChannel-1)*4);
		break;
		case Capture_Both_Edges:
			*TIM_CCER |= ((1<<3) | (1<<1))<<((CaptureChannel-1)*4);
		break;
		default:
			*TIM_CCER &= ~(((1<<3) | (1<<1))<<((CaptureChannel-1)*4));	//rising
	}

	*TIM_CCER |= 1<<((CaptureChannel-1)*4);	//capture enabled
}

void InitCaptureT2(unsigned int TimerPrescaler, unsigned int CaptureChannel, unsigned int PinMapping, unsigned int filter, unsigned int edge, unsigned int edgeprescaler)
{
	StartTimer2(TimerPrescaler);
	
	switch(PinMapping)
	{
		case Capture_TIM2_CH1_PA0:
			ConfigPortA("---- ----  ---- ---t");	//PIN in AF mode
			SetAFA(0,AF_TIM2);
		break;
		case Capture_TIM2_CH1_PA5:
			ConfigPortA("---- ----  --t- ----");	//PIN in AF mode
			SetAFA(5,AF_TIM2);
		break;
		case Capture_TIM2_CH1_PA15:
			ConfigPortA("t--- ----  ---- ----");	//PIN in AF mode
			SetAFA(15,AF_TIM2);
		break;
		
		case Capture_TIM2_CH2_PA1:
			ConfigPortA("---- ----  ---- --t-");	//PIN in AF mode
			SetAFA(1,AF_TIM2);
		break;
		case Capture_TIM2_CH2_PB3:
			ConfigPortB("---- ----  ---- t---");	//PIN in AF mode
			SetAFB(3,AF_TIM2);
		break;
		
		case Capture_TIM2_CH3_PA2:
			ConfigPortA("---- ----  ---- -t--");	//PIN in AF mode
			SetAFA(2,AF_TIM2);
		break;
		case Capture_TIM2_CH3_PB10:
			ConfigPortB("---- -t--  ---- ----");	//PIN in AF mode
			SetAFB(10,AF_TIM2);
		break;
			
