bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
		case Capture_TIM2_CH4_PA3:
			
			ConfigPortA("---- ----  ---- t---");	//PIN in AF mode
			SetAFA(3,AF_TIM2);
		break;
		case Capture_TIM2_CH4_PB11:
			
			ConfigPortB("---- t---  ---- ----");	//PIN in AF mode
			SetAFB(11,AF_TIM2);
		break;
	}
	
	InitCapture(CaptureChannel, (unsigned int *)&TIM2_CCMR1, (unsigned int *)&TIM2_CCMR2, (unsigned int *)&TIM2_CCER, filter, edge, edgeprescaler);
	ClearCaptureT2(CaptureChannel);
}

void InitCaptureT5(unsigned int TimerPrescaler, unsigned int CaptureChannel, unsigned int PinMapping, unsigned int filter, unsigned int edge, unsigned int edgeprescaler)
{
	StartTimer5(TimerPrescaler);
	
	switch(PinMapping)
	{
		case Capture_TIM5_CH1_PA0:
			ConfigPortA("---- ----  ---- ---t");	//PIN in AF mode
			SetAFA(0,AF_TIM5);
		break;
//		case Capture_TIM5_CH1_PH10:
//		break;
		
		case Capture_TIM5_CH2_PA1:
			ConfigPortA("---- ----  ---- --t-");	//PIN in AF mode
			SetAFA(1,AF_TIM5);
		break;
//		case Capture_TIM5_CH2_PH11:
//		break;
		
		case Capture_TIM5_CH3_PA2:
			
			ConfigPortA("---- ----  ---- -t--");	//PIN in AF mode
			SetAFA(2,AF_TIM5);
		break;
//		case Capture_TIM5_CH3_PH12:
//		break;
		
		case Capture_TIM5_CH4_PA3:
			
			ConfigPortA("---- ----  ---- t---");	//PIN in AF mode
			SetAFA(3,AF_TIM5);
		break;
//		case Capture_TIM5_CH4_PI0:
//		break;
	}
	
	InitCapture(CaptureChannel, (unsigned int *)&TIM5_CCMR1, (unsigned int *)&TIM5_CCMR2, (unsigned int *)&TIM5_CCER, filter, edge, edgeprescaler);
	ClearCaptureT5(CaptureChannel);
}

void InitCaptureT3(unsigned int TimerPrescaler, unsigned int CaptureChannel, unsigned int PinMapping, unsigned int filter, unsigned int edge, unsigned int edgeprescaler)
{
	StartTimer3(TimerPrescaler);
	
	switch(PinMapping)
	{
		case Capture_TIM3_CH1_PA6:
			ConfigPortA("---- ----  -t-- ----");	//PIN in AF mode
			SetAFA(5,AF_TIM3);
		break;
		case Capture_TIM3_CH1_PB4:
			ConfigPortB("---- ----  ---t ----");	//PIN in AF mode
			SetAFB(4,AF_TIM3);
		break;
		case Capture_TIM3_CH1_PC6:
			ConfigPortC("---- ----  -t-- ----");	//PIN in AF mode
			SetAFC(6,AF_TIM3);
		break;
		
		case Capture_TIM3_CH2_PA7:
			ConfigPortA("---- ----  t--- ----");	//PIN in AF mode
			SetAFA(7,AF_TIM3);
		break;
		case Capture_TIM3_CH2_PB5:
			ConfigPortB("---- ----  --t- ----");	//PIN in AF mode
			SetAFB(5,AF_TIM3);
		break;
		case Capture_TIM3_CH2_PC7:
			ConfigPortC("---- ----  t--- ----");	//PIN in AF mode
			SetAFC(7,AF_TIM3);
		break;
		
		case Capture_TIM3_CH3_PB0:
			ConfigPortB("---- ----  ---- ---t");	//PIN in AF mode
			SetAFB(0,AF_TIM3);
		break;
		case Capture_TIM3_CH3_PC8:
			ConfigPortC("---- ---t  ---- ----");	//PIN in AF mode
			SetAFC(8,AF_TIM3);
		break;
		
		case Capture_TIM3_CH4_PB1:
			ConfigPortB("---- ----  ---- --t-");	//PIN in AF mode
			SetAFB(1,AF_TIM3);
		break;
		case Capture_TIM3_CH4_PC9:
			ConfigPortC("---- --t-  ---- ----");	//PIN in AF mode
			SetAFC(9,AF_TIM3);
		break;
	}
	
	InitCapture(CaptureChannel, (unsigned int *)&TIM3_CCMR1, (unsigned int *)&TIM3_CCMR2, (unsigned int *)&TIM3_CCER, filter, edge, edgeprescaler);
	ClearCaptureT3(CaptureChannel);
}

void InitCaptureT4(unsigned int TimerPrescaler, unsigned int CaptureChannel, unsigned int PinMapping, unsigned int filter, unsigned int edge, unsigned int edgeprescaler)
{
	StartTimer4(TimerPrescaler);
	
	switch(PinMapping)
	{
		case Capture_TIM4_CH1_PB6:
			ConfigPortB("---- ----  -t-- ----");	//PIN in AF mode
			SetAFB(6,AF_TIM3);
		break;
		case Capture_TIM4_CH1_PD12:
			ConfigPortD("---t ----  ---- ----");	//PIN in AF mode
			SetAFD(12,AF_TIM3);
		break;
		
		case Capture_TIM4_CH2_PB7:
			ConfigPortB("---- ----  t--- ----");	//PIN in AF mode
			SetAFB(7,AF_TIM3);
		break;
		case Capture_TIM4_CH2_PD13:
			ConfigPortD("--t- ----  ---- ----");	//PIN in AF mode
			SetAFD(13,AF_TIM3);
		break;
		
		case Capture_TIM4_CH3_PB8:
			ConfigPortB("---- ---t  ---- ----");	//PIN in AF mode
			SetAFB(8,AF_TIM3);
		break;
		case Capture_TIM4_CH3_PD14:
			ConfigPortD("-t-- ----  ---- ----");	//PIN in AF mode
			SetAFD(14,AF_TIM3);
		break;
		
		case Capture_TIM4_CH4_PB9:
			ConfigPortB("---- --t-  ---- ----");	//PIN in AF mode
			SetAFB(9,AF_TIM3);
		break;
		case Capture_TIM4_CH4_PD15:
			ConfigPortD("t--- ----  ---- ----");	//PIN in AF mode
			SetAFD(15,AF_TIM3);
		break;	
	}
	
	InitCapture(CaptureChannel, (unsigned int *)&TIM4_CCMR1, (unsigned int *)&TIM4_CCMR2, (unsigned int *)&TIM4_CCER, filter, edge, edgeprescaler);
	ClearCaptureT4(CaptureChannel);
}

unsigned int CheckCapture(volatile unsigned int *TIM_SR, unsigned int CaptureChannel){ return (*TIM_SR>>CaptureChannel) & 1; }
unsigned int CheckCaptureT2(unsigned int CaptureChannel){ return CheckCapture((unsigned int *)&TIM2_SR, CaptureChannel); }
unsigned int CheckCaptureT5(unsigned int CaptureChannel){ return CheckCapture((unsigned int *)&TIM5_SR, CaptureChannel); }
unsigned int CheckCaptureT3(unsigned int CaptureChannel){ return CheckCapture((unsigned int *)&TIM3_SR, CaptureChannel); }
unsigned int CheckCaptureT4(unsigned int CaptureChannel){ return CheckCapture((unsigned int *)&TIM4_SR, CaptureChannel); }

void WaitCaptureT2(unsigned int CaptureChannel){ while(CheckCaptureT2(CaptureChannel)==0); }
void WaitCaptureT5(unsigned int CaptureChannel){ while(CheckCaptureT5(CaptureChannel)==0); }
void WaitCaptureT3(unsigned int CaptureChannel){ while(CheckCaptureT3(CaptureChannel)==0); }
void WaitCaptureT4(unsigned int CaptureChannel){ while(CheckCaptureT4(CaptureChannel)==0); }

void ClearCapture(volatile unsigned int *TIM_SR, unsigned int CaptureChannel){ *TIM_SR &= ~(1<<CaptureChannel); }
void ClearCaptureT2(unsigned int CaptureChannel){ ClearCapture((unsigned int *)&TIM2_SR, CaptureChannel); }
void ClearCaptureT5(unsigned int CaptureChannel){ ClearCapture((unsigned int *)&TIM5_SR, CaptureChannel); }
void ClearCaptureT3(unsigned int CaptureChannel){ ClearCapture((unsigned int *)&TIM3_SR, CaptureChannel); }
void ClearCaptureT4(unsigned int CaptureChannel){ ClearCapture((unsigned int *)&TIM4_SR, CaptureChannel); }

//these also clear the capture flag once read
unsigned int ReadCaptureT2(unsigned int CaptureChannel)
{
	switch(CaptureChannel)
	{
		case 1:
			return TIM2_CCR1;
		case 2:
			return TIM2_CCR2;
		case 3:
			return TIM2_CCR3;
		case 4:
			return TIM2_CCR4;
		default:
			return 0;
	}
}

