bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
unsigned int ReadCaptureT5(unsigned int CaptureChannel)
{
	switch(CaptureChannel)
	{
		case 1:
			return TIM5_CCR1;
		case 2:
			return TIM5_CCR2;
		case 3:
			return TIM5_CCR3;
		case 4:
			return TIM5_CCR4;
		default:
			return 0;
	}
}

unsigned int ReadCaptureT3(unsigned int CaptureChannel)
{
	switch(CaptureChannel)
	{
		case 1:
			return TIM3_CCR1;
		case 2:
			return TIM3_CCR2;
		case 3:
			return TIM3_CCR3;
		case 4:
			return TIM3_CCR4;
		default:
			return 0;
	}
}

unsigned int ReadCaptureT4(unsigned int CaptureChannel)
{
	switch(CaptureChannel)
	{
		case 1:
			return TIM4_CCR1;
		case 2:
			return TIM4_CCR2;
		case 3:
			return TIM4_CCR3;
		case 4:
			return TIM4_CCR4;
		default:
			return 0;
	}
}

//PWM
void InitPWM(volatile unsigned int *TIM_CR1, volatile unsigned int *TIM_PSC, volatile unsigned int *TIM_ARR, volatile unsigned int *TIM_CCMR1, volatile unsigned int *TIM_CCER, volatile unsigned int *TIM_CCMR2, volatile unsigned int *TIM_EGR, unsigned int prescaler, unsigned int channel, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period)	//timer runs at twice the APBx bus speed when bus divider>1. pescaler is 16 bit, and must be between 0 and 0xFFFF CK_CNT=fCK_PSC/(prescaler+1)
{	
	*TIM_CR1 &= ~(3<<8);	//no clock division, tDTS = tCK_INT
	*TIM_CR1 |= 1<<7;			//Auto-reload preload enable: TIMx_ARR register is buffered (updated only at end of period)
	*TIM_CR1 &= ~(3<<5);	//clear center aligned mode configuration bits, Edge-aligned mode. The counter counts up or down depending on the direction bit (DIR).
	*TIM_CR1 &= ~(1<<4);	//Counter used as upcounter
	*TIM_CR1 &= ~(1<<3);	//Counter is not stopped at update event
	*TIM_CR1 &= ~(1<<1);	//UEV enabled. The Update (UEV) event is generated by one of the following events: Counter overflow/underflow, Setting the UG bit, Update generation through the slave mode controller. Buffered registers are then loaded with their preload values.
	*TIM_PSC=prescaler;		//prescaler
	*TIM_CR1 |= 1<<7;			//Auto-reload preload buffered
	*TIM_ARR=period;			//set period
	if(PWMMode==PWM_Center_Aligned_mode){ *TIM_CR1 |= 1<<5; }		//Center-aligned mode 1. The counter counts up and down alternatively. Output compare interrupt flags of channels configured in output (CCxS=00 in TIMx_CCMRx register) are set only when the counter is counting down.
	
	switch(channel)
	{
		case 1:
			*TIM_CCMR1 &= ~3;			//channel is configured as output
			*TIM_CCMR1 &= ~(7<<4);
			*TIM_CCMR1 |= 6<<4;		//Output compare 1 mode
			*TIM_CCMR1 |= 1<<3;		//Output compare 1 preload enable
			
			if(PWMPolarity==PWM_Polarity_Active_High){ *TIM_CCER &= ~(1<<1); }else{ *TIM_CCER |= 1<<1; }	//OC1 output polarity=active high/low
			*TIM_CCER |= 1;			//OC1 signal is output on the corresponding output pin
		break;
		
		case 2:
			*TIM_CCMR1 &= ~(3<<8);//channel is configured as output
			*TIM_CCMR1 &= ~(7<<12);
			*TIM_CCMR1 |= 6<<12;	//Output compare 2 mode
			*TIM_CCMR1 |= 1<<11;	//Output compare 2 preload enable
		
			if(PWMPolarity==PWM_Polarity_Active_High){ *TIM_CCER &= ~(1<<5); }else{ *TIM_CCER |= 1<<5; }	//OC2 output polarity=active high/low
			*TIM_CCER |= 1<<4;		//OC2 signal is output on the corresponding output pin
		break;
		
		case 3:
			*TIM_CCMR2 &= ~3;			//channel is configured as output
			*TIM_CCMR2 &= ~(7<<4);
			*TIM_CCMR2 |= 6<<4;		//Output compare 3 mode
			*TIM_CCMR2 |= 1<<3;		//Output compare 3 preload enable
			
			if(PWMPolarity==PWM_Polarity_Active_High){ *TIM_CCER &= ~(1<<9); }else{ *TIM_CCER |= 1<<9; }	//OC3 output polarity=active high/low
			*TIM_CCER |= 1<<8;		//OC3 signal is output on the corresponding output pin
		break;
		
		case 4:
			*TIM_CCMR2 &= ~(3<<8);//channel is configured as output
			*TIM_CCMR2 &= ~(7<<12);
			*TIM_CCMR2 |= 6<<12;	//Output compare 4 mode
			*TIM_CCMR2 |= 1<<11;	//Output compare 4 preload enable
			
			if(PWMPolarity==PWM_Polarity_Active_High){ *TIM_CCER &= ~(1<<13); }else{ *TIM_CCER |= 1<<13; }	//OC4 output polarity=active high/low
			*TIM_CCER |= 1<<12;		//OC4 signal is output on the corresponding output pin
		break;
	}

	*TIM_EGR |= 1;					//Re-initialize the counter and generates an update of the registers
	*TIM_CR1 |= 1;					//counter enabled
}

void InitPWM1(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer1
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
	if((PinMapping==PWM_TIM1_CH1_PA8) || (PinMapping==PWM_TIM1_CH1_PE9)){ channel=1; }
	if((PinMapping==PWM_TIM1_CH2_PA9) || (PinMapping==PWM_TIM1_CH2_PE11)){ channel=2; }
	if((PinMapping==PWM_TIM1_CH3_PA10) || (PinMapping==PWM_TIM1_CH3_PE13)){ channel=3; }
	if((PinMapping==PWM_TIM1_CH4_PA11) || (PinMapping==PWM_TIM1_CH4_PE14)){ channel=4; }

	RCC_APB2ENR |= 1;		//timer 1 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM1_CH1_PA8:
					ConfigPortA("---- ---t  ---- ----");	//afio 100Mhz on TIM1_CH1 (PA8)
					SetAFA(8,AF_TIM1);
				break;
				case PWM_TIM1_CH1_PE9:
					ConfigPortE("---- --t-  ---- ----");	//afio 100Mhz on TIM1_CH1 (PE9)
					SetAFE(9,AF_TIM1);
				break;
			}
			TIM1_CCR1=initduty;						//starting duty
		break;
			
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM1_CH2_PA9:
					ConfigPortA("---- --t-  ---- ----");	//afio 100Mhz on TIM1_CH2 (PA9)
					SetAFA(9,AF_TIM1);
				break;
				case PWM_TIM1_CH2_PE11:
					ConfigPortE("---- t---  ---- ----");	//afio 100Mhz on TIM1_CH2 (PE11)
					SetAFE(11,AF_TIM1);
				break;
			}
			TIM1_CCR2=initduty;						//starting duty
		break;
			
		case 3:
			switch(PinMapping)
			{
				case PWM_TIM1_CH3_PA10:
					ConfigPortA("---- -t--  ---- ----");	//afio 100Mhz on TIM1_CH3 (PA10)
					SetAFA(10,AF_TIM1);
				break;
				case PWM_TIM1_CH3_PE13:
					ConfigPortE("--t- ----  ---- ----");	//afio 100Mhz on TIM1_CH3 (PE13)
					SetAFE(12,AF_TIM1);
				break;
			}
			TIM1_CCR3=initduty;						//starting duty
		break;
		case 4:
			switch(PinMapping)
			{
				case PWM_TIM1_CH4_PA11:
					ConfigPortA("---- t---  ---- ----");	//afio 100Mhz on TIM1_CH4 (PA11)
					SetAFA(11,AF_TIM1);
				break;
				case PWM_TIM1_CH4_PE14:
					ConfigPortE("-t-- ----  ---- ----");	//afio 100Mhz on TIM1_CH4 (PE14)
					SetAFE(14,AF_TIM1);
				break;
			}
			TIM1_CCR4=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM1_CR1, (unsigned int *)&TIM1_PSC, (unsigned int *)&TIM1_ARR, (unsigned int *)&TIM1_CCMR1, (unsigned int *)&TIM1_CCER, (unsigned int *)&TIM1_CCMR2, (unsigned int *)&TIM1_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

void InitPWM2(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer2
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
