bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
	if((PinMapping==PWM_TIM2_CH1_PA0) || (PinMapping==PWM_TIM2_CH1_PA5)){ channel=1; }
	if((PinMapping==PWM_TIM2_CH2_PA1) || (PinMapping==PWM_TIM2_CH2_PB3)){ channel=2; }
	if((PinMapping==PWM_TIM2_CH3_PA2) || (PinMapping==PWM_TIM2_CH3_PB10)){ channel=3; }
	if((PinMapping==PWM_TIM2_CH4_PA3) || (PinMapping==PWM_TIM2_CH4_PB11)){ channel=4; }

	RCC_APB1ENR |= 1;		//timer 2 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM2_CH1_PA0:
					ConfigPortA("---- ----  ---- ---t");	//afio 100Mhz on TIM2_CH1 (PA0)
					SetAFA(0,AF_TIM2);
				break;
				case PWM_TIM2_CH1_PA5:
					ConfigPortA("---- ----  --t- ----");	//afio 100Mhz on TIM2_CH1 (PA5)
					SetAFA(5,AF_TIM2);
				break;
			}
			TIM2_CCR1=initduty;						//starting duty
		break;
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM2_CH2_PA1:
					ConfigPortA("---- ----  ---- --t-");	//afio 100Mhz on TIM2_CH2 (PA1)
					SetAFA(1,AF_TIM2);
				break;
				case PWM_TIM2_CH2_PB3:
					ConfigPortB("---- ----  ---- t---");	//afio 100Mhz on TIM2_CH2 (PB3)
					SetAFB(3,AF_TIM2);
				break;
			}
			TIM2_CCR2=initduty;						//starting duty
		break;
		case 3:
			switch(PinMapping)
			{
				case PWM_TIM2_CH3_PA2:
					ConfigPortA("---- ----  ---- -t--");	//afio 100Mhz on TIM2_CH3 (PA2)
				SetAFA(2,AF_TIM2);
				break;
				case PWM_TIM2_CH3_PB10:
					ConfigPortB("---- -t--  ---- ----");	//afio 100Mhz on TIM2_CH3 (PB10)
					SetAFB(10,AF_TIM2);
				break;
			}
			TIM2_CCR3=initduty;						//starting duty
		break;
		case 4:
			switch(PinMapping)
			{
				case PWM_TIM2_CH4_PA3:
					ConfigPortA("---- ----  ---- t---");	//afio 190Mhz on TIM2_CH4 (PA3)
					SetAFA(3,AF_TIM2);
				break;
				case PWM_TIM2_CH4_PB11:
					ConfigPortB("---- t---  ---- ----");	//afio 100Mhz on TIM2_CH4 (PB11)
					SetAFB(11,AF_TIM2);
				break;
			}
			TIM2_CCR4=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM2_CR1, (unsigned int *)&TIM2_PSC, (unsigned int *)&TIM2_ARR, (unsigned int *)&TIM2_CCMR1, (unsigned int *)&TIM2_CCER, (unsigned int *)&TIM2_CCMR2, (unsigned int *)&TIM2_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

void InitPWM3(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer2
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
	if((PinMapping==PWM_TIM3_CH1_PA6) || (PinMapping==PWM_TIM3_CH1_PB4) || (PinMapping==PWM_TIM3_CH1_PC6)){ channel=1; }
	if((PinMapping==PWM_TIM3_CH2_PA7) || (PinMapping==PWM_TIM3_CH2_PB5) || (PinMapping==PWM_TIM3_CH2_PC7)){ channel=2; }
	if(PinMapping==PWM_TIM3_CH3_PB0){ channel=3; }
	if(PinMapping==PWM_TIM3_CH4_PB1){ channel=4; }

	RCC_APB1ENR |= 1<<1;		//timer 3 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM3_CH1_PA6:
					ConfigPortA("---- ----  -t-- ----");	//afio 100Mhz on TIM3_CH1 (PA6)
					SetAFA(6,AF_TIM3);
				break;
				case PWM_TIM3_CH1_PB4:
					ConfigPortB("---- ----  ---t ----");	//afio 100Mhz on TIM3_CH1 (PB4)
					SetAFB(4,AF_TIM3);
				break;
				case PWM_TIM3_CH1_PC6:
					ConfigPortC("---- ----  -t-- ----");	//afio 100Mhz on TIM3_CH1 (PC6)
					SetAFC(6,AF_TIM3);
				break;
			}
			TIM3_CCR1=initduty;						//starting duty
		break;
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM3_CH2_PA7:
					ConfigPortA("---- ----  t--- ----");	//afio 100Mhz on TIM3_CH2 (PA7)
					SetAFA(7,AF_TIM3);
				break;
				case PWM_TIM3_CH2_PB5:
					ConfigPortB("---- ----  --t- ----");	//afio 100Mhz on TIM3_CH2 (PB5)
					SetAFB(5,AF_TIM3);
				break;
				case PWM_TIM3_CH2_PC7:
					ConfigPortC("---- ----  t--- ----");	//afio 100Mhz on TIM3_CH2 (PC7)
					SetAFC(7,AF_TIM3);
				break;
			}
			TIM3_CCR2=initduty;						//starting duty
		break;
		case 3:
			switch(PinMapping)
			{
				case PWM_TIM3_CH3_PB0:
					ConfigPortB("---- ----  ---- ---t");	//afio 100Mhz on TIM3_CH3 (PB0)
				SetAFB(0,AF_TIM3);
				break;
			}
			TIM3_CCR3=initduty;						//starting duty
		break;
		case 4:
			switch(PinMapping)
			{
				case PWM_TIM3_CH4_PB1:
					ConfigPortB("---- ----  ---- --t-");	//afio 100Mhz on TIM3_CH4 (PB1)
					SetAFB(1,AF_TIM3);
				break;
			}
			TIM3_CCR4=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM3_CR1, (unsigned int *)&TIM3_PSC, (unsigned int *)&TIM3_ARR, (unsigned int *)&TIM3_CCMR1, (unsigned int *)&TIM3_CCER, (unsigned int *)&TIM3_CCMR2, (unsigned int *)&TIM3_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

void InitPWM4(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer2
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
	if((PinMapping==PWM_TIM4_CH1_PB6) || (PinMapping==PWM_TIM4_CH1_PD12)){ channel=1; }
	if((PinMapping==PWM_TIM4_CH2_PB7) || (PinMapping==PWM_TIM4_CH2_PD13)){ channel=2; }
	if((PinMapping==PWM_TIM4_CH3_PB8) || (PinMapping==PWM_TIM4_CH3_PD14)){ channel=3; }
	if((PinMapping==PWM_TIM4_CH4_PB9) || (PinMapping==PWM_TIM4_CH4_PD15)){ channel=4; }

	RCC_APB1ENR |= 1<<2;		//timer 4 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM4_CH1_PB6:
					ConfigPortB("---- ----  -t-- ----");	//afio 100Mhz on TIM4_CH1 (PB6)
					SetAFB(6,AF_TIM4);
				break;
				case PWM_TIM4_CH1_PD12:
					ConfigPortD("---t ----  ---- ----");	//afio 100Mhz on TIM4_CH1 (PD12)
					SetAFD(12,AF_TIM4);
				break;
			}
			TIM4_CCR1=initduty;						//starting duty
		break;
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM4_CH2_PB7:
					ConfigPortB("---- ----  t--- ----");	//afio 100Mhz on TIM4_CH2 (PB7)
					SetAFB(7,AF_TIM4);
				break;
				case PWM_TIM4_CH2_PD13:
					ConfigPortD("--t- ----  ---- ----");	//afio 100Mhz on TIM4_CH2 (PD13)
					SetAFD(13,AF_TIM4);
				break;
			}
			TIM4_CCR2=initduty;						//starting duty
		break;
		case 3:
			switch(PinMapping)
			{
				case PWM_TIM4_CH3_PB8:
					ConfigPortB("---- ---t  ---- ----");	//afio 100Mhz on TIM4_CH3 (PB8)
				SetAFB(8,AF_TIM4);
				break;
				case PWM_TIM4_CH3_PD14:
					ConfigPortD("-t-- ----  ---- ----");	//afio 100Mhz on TIM4_CH3 (PD14)
					SetAFD(14,AF_TIM4);
				break;
			}
			TIM4_CCR3=initduty;						//starting duty
		break;
		case 4:
			switch(PinMapping)
			{
				case PWM_TIM4_CH4_PB9:
					ConfigPortB("---- --t-  ---- ----");	//afio 190Mhz on TIM4_CH4 (PB9)
					SetAFB(9,AF_TIM4);
				break;
				case PWM_TIM4_CH4_PD15:
					ConfigPortD("t--- ----  ---- ----");	//afio 100Mhz on TIM4_CH4 (PD15)
					SetAFD(15,AF_TIM4);
				break;
			}
			TIM4_CCR4=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM4_CR1, (unsigned int *)&TIM4_PSC, (unsigned int *)&TIM4_ARR, (unsigned int *)&TIM4_CCMR1, (unsigned int *)&TIM4_CCER, (unsigned int *)&TIM4_CCMR2, (unsigned int *)&TIM4_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

