bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
void InitPWM5(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer2
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
	if((PinMapping==PWM_TIM5_CH1_PA0) || (PinMapping==PWM_TIM5_CH1_PH10)){ channel=1; }
	if((PinMapping==PWM_TIM5_CH2_PA1) || (PinMapping==PWM_TIM5_CH2_PH11)){ channel=2; }
	if((PinMapping==PWM_TIM5_CH3_PA2) || (PinMapping==PWM_TIM5_CH3_PH12)){ channel=3; }
	if((PinMapping==PWM_TIM5_CH4_PA4) || (PinMapping==PWM_TIM5_CH4_PI0)){ channel=4; }

	RCC_APB1ENR |= 1<<3;		//timer 5 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM5_CH1_PA0:
					ConfigPortA("---- ----  ---- ---t");	//afio 100Mhz on TIM5_CH1 (PA0)
					SetAFA(0,AF_TIM5);
				break;
				case PWM_TIM5_CH1_PH10:
					ConfigPortH("---- -t--  ---- ----");	//afio 100Mhz on TIM5_CH1 (PH10)
					SetAFH(10,AF_TIM5);
				break;
			}
			TIM5_CCR1=initduty;						//starting duty
		break;
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM5_CH2_PA1:
					ConfigPortA("---- ----  ---- --t-");	//afio 100Mhz on TIM5_CH2 (PA1)
					SetAFA(1,AF_TIM5);
				break;
				case PWM_TIM5_CH2_PH11:
					ConfigPortH("---- t---  ---- ----");	//afio 100Mhz on TIM5_CH2 (PH11)
					SetAFH(11,AF_TIM5);
				break;
			}
			TIM5_CCR2=initduty;						//starting duty
		break;
		case 3:
			switch(PinMapping)
			{
				case PWM_TIM5_CH3_PA2:
					ConfigPortA("---- ----  ---- -t--");	//afio 100Mhz on TIM5_CH3 (PA2)
				SetAFA(2,AF_TIM5);
				break;
				case PWM_TIM5_CH3_PH12:
					ConfigPortH("---t ----  ---- ----");	//afio 100Mhz on TIM5_CH3 (PH12)
					SetAFH(12,AF_TIM5);
				break;
			}
			TIM5_CCR3=initduty;						//starting duty
		break;
		case 4:
			switch(PinMapping)
			{
				case PWM_TIM5_CH4_PA4:
					ConfigPortA("---- ----  ---t ----");	//afio 190Mhz on TIM5_CH4 (PA4)
					SetAFA(4,AF_TIM5);
				break;
				case PWM_TIM5_CH4_PI0:
					ConfigPortI("---- ----  ---- ---t");	//afio 100Mhz on TIM5_CH4 (PI0)
					SetAFI(0,AF_TIM5);
				break;
			}
			TIM5_CCR4=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM5_CR1, (unsigned int *)&TIM5_PSC, (unsigned int *)&TIM5_ARR, (unsigned int *)&TIM5_CCMR1, (unsigned int *)&TIM5_CCER, (unsigned int *)&TIM5_CCMR2, (unsigned int *)&TIM5_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

void InitPWM9(unsigned int prescaler, unsigned int PWMMode, unsigned int PWMPolarity, unsigned int period, unsigned int initduty, unsigned int PinMapping)	//PWM channels on timer9
{
	unsigned int channel=1;
	
	if(PWMMode==PWM_Center_Aligned_mode)	//if centre mode, halve the period and duty and invert polarity to preserve timing and pulse width
	{
		initduty=(period-initduty)>>1;
		period=period>>1;
		if(PWMPolarity==PWM_Polarity_Active_High){ PWMPolarity=PWM_Polarity_Active_Low; }else{ PWMPolarity=PWM_Polarity_Active_High; }
	}
	
	if((PinMapping==PWM_TIM9_CH1_PA2) || (PinMapping==PWM_TIM9_CH1_PE5)){ channel=1; }
	if((PinMapping==PWM_TIM9_CH2_PA3) || (PinMapping==PWM_TIM9_CH2_PE6)){ channel=2; }

	RCC_APB2ENR |= 1<<16;		//timer 9 clock enable
	switch(channel)
	{
		case 1:
			switch(PinMapping)
			{
				case PWM_TIM9_CH1_PA2:
					ConfigPortA("---- ----  ---- -t--");	//afio 100Mhz on TIM9_CH1 (PA2)
					SetAFA(2,AF_TIM9);
				break;
				case PWM_TIM9_CH1_PE5:
					ConfigPortE("---- ----  --t- ----");	//afio 100Mhz on TIM9_CH1 (PE5)
					SetAFE(5,AF_TIM9);
				break;
			}
			TIM9_CCR1=initduty;						//starting duty
		break;
			
		case 2:
			switch(PinMapping)
			{
				case PWM_TIM9_CH2_PA3:
					ConfigPortA("---- ----  ---- t---");	//afio 100Mhz on TIM9_CH2 (PA3)
					SetAFA(3,AF_TIM9);
				break;
				case PWM_TIM9_CH2_PE6:
					ConfigPortE("---- ----  -t-- ----");	//afio 100Mhz on TIM9_CH2 (PE6)
					SetAFE(6,AF_TIM9);
				break;
			}
			TIM9_CCR2=initduty;						//starting duty
		break;
	}
	
	InitPWM((unsigned int *)&TIM9_CR1, (unsigned int *)&TIM9_PSC, (unsigned int *)&TIM9_ARR, (unsigned int *)&TIM9_CCMR1, (unsigned int *)&TIM9_CCER, (unsigned int *)&TIM9_CCMR2, (unsigned int *)&TIM9_EGR, prescaler, channel, PWMMode, PWMPolarity, period);
}

void SetPWM1(unsigned int channel, unsigned int duty)
{
	if(((TIM1_CR1>>5) & 1)==1){ duty=((TIM1_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM1_CCR1=duty;						//duty
		break;
		case 2:
			TIM1_CCR2=duty;						//duty
		break;
		case 3:
			TIM1_CCR3=duty;						//duty
		break;
		case 4:
			TIM1_CCR4=duty;						//duty
		break;
	}
}

void SetPWM2(unsigned int channel, unsigned int duty)
{
	if(((TIM2_CR1>>5) & 1)==1){ duty=((TIM2_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM2_CCR1=duty;						//duty
		break;
		case 2:
			TIM2_CCR2=duty;						//duty
		break;
		case 3:
			TIM2_CCR3=duty;						//duty
		break;
		case 4:
			TIM2_CCR4=duty;						//duty
		break;
	}
}

void SetPWM3(unsigned int channel, unsigned int duty)
{
	if(((TIM3_CR1>>5) & 1)==1){ duty=((TIM3_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM3_CCR1=duty;						//duty
		break;
		case 2:
			TIM3_CCR2=duty;						//duty
		break;
		case 3:
			TIM3_CCR3=duty;						//duty
		break;
		case 4:
			TIM3_CCR4=duty;						//duty
		break;
	}
}

void SetPWM4(unsigned int channel, unsigned int duty)
{
	if(((TIM4_CR1>>5) & 1)==1){ duty=((TIM4_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM4_CCR1=duty;						//duty
		break;
		case 2:
			TIM4_CCR2=duty;						//duty
		break;
		case 3:
			TIM4_CCR3=duty;						//duty
		break;
		case 4:
			TIM4_CCR4=duty;						//duty
		break;
	}
}

void SetPWM5(unsigned int channel, unsigned int duty)
{
	if(((TIM5_CR1>>5) & 1)==1){ duty=((TIM5_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM5_CCR1=duty;						//duty
		break;
		case 2:
			TIM5_CCR2=duty;						//duty
		break;
		case 3:
			TIM5_CCR3=duty;						//duty
		break;
		case 4:
			TIM5_CCR4=duty;						//duty
		break;
	}
}

void SetPWM9(unsigned int channel, unsigned int duty)
{
	if(((TIM9_CR1>>5) & 1)==1){ duty=((TIM9_ARR<<1)-duty)>>1; }	//if centre mode, change the duty

	switch(channel)
	{
		case 1:
			TIM9_CCR1=duty;						//duty
		break;
		case 2:
			TIM9_CCR2=duty;						//duty
		break;
	}
}

void PWM_UpdateEnable1(unsigned int en)
{
	if(en==1)
	{
		TIM1_CR1 &= ~(1<<1);					//enable updates
		TIM1_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM1_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM1_CR1 |= 1<<1;						//disable updates
	}
}

void PWM_UpdateEnable2(unsigned int en)
{
	if(en==1)
	{
		TIM2_CR1 &= ~(1<<1);					//enable updates
		TIM2_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM2_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM2_CR1 |= 1<<1;						//disable updates
	}
}

void PWM_UpdateEnable3(unsigned int en)
{
	if(en==1)
	{
		TIM3_CR1 &= ~(1<<1);					//enable updates
		TIM3_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM3_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM3_CR1 |= 1<<1;						//disable updates
	}
}

void PWM_UpdateEnable4(unsigned int en)
{
	if(en==1)
	{
		TIM4_CR1 &= ~(1<<1);					//enable updates
		TIM4_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM4_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM4_CR1 |= 1<<1;						//disable updates
	}
}

void PWM_UpdateEnable5(unsigned int en)
{
	if(en==1)
	{
		TIM5_CR1 &= ~(1<<1);					//enable updates
		TIM5_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM5_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM5_CR1 |= 1<<1;						//disable updates
	}
}

void PWM_UpdateEnable9(unsigned int en)
{
	if(en==1)
	{
		TIM9_CR1 &= ~(1<<1);					//enable updates
		TIM9_SR &= ~1;							//clear update event flag,	This bit is set by hardware on an update event. It is cleared by software.
		while((TIM9_SR & 1)==0);				//wait for up update event (PWMs have been applied)
	}else
	{
		TIM9_CR1 |= 1<<1;						//disable updates
	}
}

