bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
//RTC
void InitRTC(unsigned int year, unsigned int month, unsigned int date, unsigned int DayOfWeek, unsigned int hours, unsigned int minutes, unsigned int seconds, int DaylightSavingsOffset, unsigned int format)
{
	RCC_CFGR |= 8<<16;	//HSE/8 (8MHz xtal) to give 1Mhz to the RTC
	RCC_APB1ENR |= 1<<28;	//Power interface clock enable
	RCC_AHB1ENR |= 1<<18;	//Backup SRAM interface clock enable
	PWR_CR |= 1<<8;		//the DBP bit (Access to RTC and RTC Backup registers and backup SRAM enabled) in the PWR power control register (PWR_CR) for STM32F42xxx and STM32F43xxx has to be set before these can be modified
	RCC_BDCR |= 3<<8;	//HSE oscillator clock selected for RTC
	RCC_BDCR |= 1<<15;	//RTC clock enabled
	
	//dissable write protection of RTC registers
	RTC_WPR=0xCA;
	RTC_WPR=0x53;
	
	if(format==0){ RTC_CR &= ~(1<<6); }else{ RTC_CR |= 1<<6; }	//0=24 hour/day format, 1=AM/PM hour format
	
	RTC_ISR |= 1<<7; //Set INIT bit to 1 in the RTC_ISR to stop the calendar counter and allow its value can be updated
	while(((RTC_ISR>>6) & 1)==0);	//Poll INITF bit of in the RTC_ISR register to wait for initialization phase mode to be entered

	//write TWICE to RTC_PRER to set the prescalers to generate 1Hz
	/*
	f CK_SPRE (1Hz)=(f RTCCLK (1MHz) / (PREDIV_A+1) / (PREDIV_S+1)

	Bits 22:16 PREDIV_A[6:0]: Asynchronous prescaler factor
	This is the asynchronous division factor:
	ck_apre frequency = RTCCLK frequency/(PREDIV_A+1)

	Bits 14:0 PREDIV_S[14:0]: Synchronous prescaler factor
	This is the synchronous division factor:
	ck_spre frequency = ck_apre frequency/(PREDIV_S+1)

	1=(1000000/(99+1))/(9999+1)
	*/
	RTC_PRER = 99<<16;
	RTC_PRER |= 9999;
	
	//Load the initial time and date values in the shadow registers (RTC_TR and RTC_DR), and configure the time format (12 or 24 hours) through the FMT bit in the RTC_CR register.
	RTC_TR = 0;	//this also sets 24 hour format
	RTC_TR |= (hours/10)<<20;	//hours (tens)
	RTC_TR |= (hours%10)<<16;	//hours (units)
	RTC_TR |= (minutes/10)<<12;	//minutes (tens)
	RTC_TR |= (minutes%10)<<8;	//minutes (units)
	RTC_TR |= (seconds/10)<<4;	//seconds (tens)
	RTC_TR |= seconds%10;	//seconds (units)
	
	RTC_DR=0;
	RTC_DR |= ((year%100)/10)<<20;	//year (tens)
	RTC_DR |= (year%10)<<16;	//year (units)
	RTC_DR |= DayOfWeek<<13;	//day of week 1=monday
	RTC_DR |= (month/10)<<12;	//month (tens)
	RTC_DR |= (month%10)<<8;	//month (units)
	RTC_DR |= (date/10)<<4;	//date (tens)
	RTC_DR |= date%10;	//date (units)
	
	RTCyear=year;	//global register

	RTC_ISR &= ~(1<<7);	//Exit the initialization mode by clearing the INIT bit. When the initialization sequence is complete, the calendar starts counting
	while(((RTC_ISR>>5) & 1)==0);	//After an initialization, the software must wait until RSF is set before reading the RTC_SSR, RTC_TR and RTC_DR registers

	//The daylight saving time management is performed through bits SUB1H, ADD1H, and BKP of the RTC_CR register, must be set outside initialization mode
	if(DaylightSavingsOffset>0){ RTC_CR |= 1<<16; }	//Add 1 hour (summer time change)
	if(DaylightSavingsOffset<0){ RTC_CR |= 1<<17; }	//Subtract 1 hour (winter time change)
	if(DaylightSavingsOffset==0){ RTC_CR &= ~(3<<16); }	//no DST offset
}

unsigned int IsRTCUpdated(void)
{
	return (RTC_ISR>>5) & 1;
}

struct RTCType ReadRTC(void)
{
	struct RTCType DateTime;
	
	DateTime.AMPM=(RTC_TR>>22) & 1;
	DateTime.Hours=(((RTC_TR>>20) & 3)*10)+((RTC_TR>>16) & 0xF);
	DateTime.Minutes=(((RTC_TR>>12) & 7)*10)+((RTC_TR>>8) & 0xF);
	DateTime.Seconds=(((RTC_TR>>4) & 7)*10)+(RTC_TR & 0xF);
	DateTime.Year=(RTCyear-(RTCyear%100))+(((RTC_DR>>20) & 0xF)*10)+((RTC_DR>>16) & 0xF);
	DateTime.DayOfWeek=((RTC_DR>>13) & 7);
	DateTime.Month=(((RTC_DR>>12) & 1)*10)+((RTC_DR>>8) & 0xF);
	DateTime.Date=(((RTC_DR>>4) & 3)*10)+(RTC_DR & 0xF);
	
	RTC_ISR &= ~(1>>5);	//RSF must be cleared by software after the first calendar read, and then the software must wait until RSF is set before reading again the RTC_SSR, RTC_TR and RTC_DR registers

	return DateTime;
}


// Configure the systick timer with a timebase in ns, return the true timebase
unsigned int configSYSTICK(unsigned int timebase) {
	unsigned int HCLK = GetAHBFreq();
	unsigned int HCLK_period = ((unsigned int)1000000000<<2) / HCLK;	// Multiply by 4 to get two bits of extra resolution... (may still need more)
	unsigned int HCLK_ticks = ((timebase<<2) / HCLK_period);	

	SYSTICK_CSR &= ~(1<<1);												// Disable systick interrupt
	SYSTICK_CSR |= 1<<2;												// Clock source = core clock (HCLK)
	if ((HCLK_ticks & 7) == 0) {										// Check if we can slow down the systick timer by a factor of 8 to save power
		HCLK_ticks >>= 3;
		SYSTICK_CSR &= ~(1<<2);											// Clock source = HCLK / 8
	} 
	SYSTICK_RVR = HCLK_ticks - 1;
	SYSTICK_CSR |= 1<<0;												// Enable counter

	return (HCLK_period * ((timebase<<2) / HCLK_period))>>2;
}

// Wait for n ticks of SYSTICK timer, period set with configSYSTICK(unsigned int timebase)
void waitsys (unsigned int ticks) {
	while (ticks) {
		if (SYSTICK_CSR & (1<<16)) ticks -= 1;
	}
}

unsigned int GetPinAF(unsigned int port, unsigned int pinnumber)
{
	unsigned int portAF, pinAF;
	
	switch(port)
	{
		case PORTA:
			if(pinnumber<8){ portAF=GPIOA_AFRL; }else{ portAF=GPIOA_AFRH; }
			break;
		case PORTB:
			if(pinnumber<8){ portAF=GPIOB_AFRL; }else{ portAF=GPIOB_AFRH; }
			break;
		case PORTC:
			if(pinnumber<8){ portAF=GPIOC_AFRL; }else{ portAF=GPIOC_AFRH; }
			break;
		case PORTD:
			if(pinnumber<8){ portAF=GPIOD_AFRL; }else{ portAF=GPIOD_AFRH; }
			break;
		case PORTE:
			if(pinnumber<8){ portAF=GPIOE_AFRL; }else{ portAF=GPIOE_AFRH; }
			break;
		case PORTF:
			if(pinnumber<8){ portAF=GPIOF_AFRL; }else{ portAF=GPIOF_AFRH; }
			break;
		case PORTG:
			if(pinnumber<8){ portAF=GPIOG_AFRL; }else{ portAF=GPIOG_AFRH; }
			break;
		case PORTH:
			if(pinnumber<8){ portAF=GPIOH_AFRL; }else{ portAF=GPIOH_AFRH; }
			break;
		case PORTI:
			if(pinnumber<8){ portAF=GPIOI_AFRL; }else{ portAF=GPIOI_AFRH; }
			break;
		default:
			break;
	}
	
	if(pinnumber>7){ pinnumber-=8; }
	pinAF=(portAF>>(pinnumber<<2)) & 0xF;
	
	return pinAF;
}

unsigned int GetPinAFA(unsigned int pinnumber){ return GetPinAF(PORTA, pinnumber); }
unsigned int GetPinAFB(unsigned int pinnumber){ return GetPinAF(PORTB, pinnumber); }
unsigned int GetPinAFC(unsigned int pinnumber){ return GetPinAF(PORTC, pinnumber); }
unsigned int GetPinAFD(unsigned int pinnumber){ return GetPinAF(PORTD, pinnumber); }
unsigned int GetPinAFE(unsigned int pinnumber){ return GetPinAF(PORTE, pinnumber); }
unsigned int GetPinAFF(unsigned int pinnumber){ return GetPinAF(PORTF, pinnumber); }
unsigned int GetPinAFG(unsigned int pinnumber){ return GetPinAF(PORTG, pinnumber); }
unsigned int GetPinAFH(unsigned int pinnumber){ return GetPinAF(PORTH, pinnumber); }
unsigned int GetPinAFI(unsigned int pinnumber){ return GetPinAF(PORTI, pinnumber); }

