bjornbaverfjord/STM32F429-Discovery/STM32F4-lib.c
unsigned int IsPinAF(unsigned int port, unsigned int pinnumber)
{
	if(GetPinAF(port, pinnumber)==0){ return 0; }else{ return 1; }
}

unsigned int IsPinAFA(unsigned int pinnumber){ return IsPinAF(PORTA, pinnumber); }
unsigned int IsPinAFB(unsigned int pinnumber){ return IsPinAF(PORTB, pinnumber); }
unsigned int IsPinAFC(unsigned int pinnumber){ return IsPinAF(PORTC, pinnumber); }
unsigned int IsPinAFD(unsigned int pinnumber){ return IsPinAF(PORTD, pinnumber); }
unsigned int IsPinAFE(unsigned int pinnumber){ return IsPinAF(PORTE, pinnumber); }
unsigned int IsPinAFF(unsigned int pinnumber){ return IsPinAF(PORTF, pinnumber); }
unsigned int IsPinAFG(unsigned int pinnumber){ return IsPinAF(PORTG, pinnumber); }
unsigned int IsPinAFH(unsigned int pinnumber){ return IsPinAF(PORTH, pinnumber); }
unsigned int IsPinAFI(unsigned int pinnumber){ return IsPinAF(PORTI, pinnumber); }

void InitGPIOInterrupts(unsigned int port, unsigned int pinnumber, unsigned int edge)
{
	unsigned int portnum;
	
	//check if the pin is used as AF, if so, dont reconfigure it
	if(IsPinAF(port, pinnumber)==0)
	{
		ConfigPinOnPort(port,pinnumber,'i');
	}
	
	EXTI_IMR=1<<pinnumber;	//EXTI line number selection
	switch(edge)
	{
		case Capture_Rising_Edge:
			EXTI_RTSR=1<<pinnumber;	//line selection for rising trigger
			break;
		case Capture_Falling_Edge:
			EXTI_FTSR=1<<pinnumber;	//line selection for falling trigger
			break;
		case Capture_Both_Edges:
			EXTI_RTSR=1<<pinnumber;	//line selection for rising trigger
			EXTI_FTSR=1<<pinnumber;	//line selection for falling trigger
			break;
		default:
			break;
	}
	
	switch(port)
	{
		case PORTA:
			portnum=0;
			break;
		case PORTB:
			portnum=1;
			break;
		case PORTC:
			portnum=2;
			break;
		case PORTD:
			portnum=3;
			break;
		case PORTE:
			portnum=4;
			break;
		case PORTF:
			portnum=5;
			break;
		case PORTG:
			portnum=6;
			break;
		case PORTH:
			portnum=7;
			break;
		case PORTI:
			portnum=8;
			break;
		default:
			break;
	}
	
	RCC_APB2ENR |= 1<<14;	//clock enable for SYSCFG
	switch(pinnumber>>2)	//Select port for EXTI
	{
		case 0:
			SYSCFG_EXTICR1 = (SYSCFG_EXTICR1 & ~0xF) | portnum;	
			break;
		case 1:
			SYSCFG_EXTICR2 = (SYSCFG_EXTICR2 & ~0xF) | portnum;
			break;
		case 2:
			SYSCFG_EXTICR3 = (SYSCFG_EXTICR3 & ~0xF) | portnum;
			break;
		case 3:
			SYSCFG_EXTICR4 = (SYSCFG_EXTICR4 & ~0xF) | portnum;
			break;
		default:
			break;
	}
	
	switch(pinnumber)
	{
		case 0:
			EnableInterruptPosition(EXTI0_Interrupt_Position);
			break;
		case 1:
			EnableInterruptPosition(EXTI1_Interrupt_Position);
			break;
		case 2:
			EnableInterruptPosition(EXTI2_Interrupt_Position);
			break;
		case 3:
			EnableInterruptPosition(EXTI3_Interrupt_Position);
			break;
		case 4:
			EnableInterruptPosition(EXTI4_Interrupt_Position);
			break;
		
		case 5:
			EnableInterruptPosition(EXTI9_5_Interrupt_Position);
			break;
		case 6:
			EnableInterruptPosition(EXTI9_5_Interrupt_Position);
			break;
		case 7:
			EnableInterruptPosition(EXTI9_5_Interrupt_Position);
			break;
		case 8:
			EnableInterruptPosition(EXTI9_5_Interrupt_Position);
			break;
		case 9:
			EnableInterruptPosition(EXTI9_5_Interrupt_Position);
			break;
		
		case 10:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		case 11:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		case 12:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		case 13:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		case 14:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		case 15:
			EnableInterruptPosition(EXTI15_10_Interrupt_Position);
			break;
		default:
			break;
	}
}
	
void InitGPIOAInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTA, pinnumber, edge); }
void InitGPIOBInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTB, pinnumber, edge); }
void InitGPIOCInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTC, pinnumber, edge); }
void InitGPIODInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTD, pinnumber, edge); }
void InitGPIOEInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTE, pinnumber, edge); }
void InitGPIOFInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTF, pinnumber, edge); }
void InitGPIOGInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTG, pinnumber, edge); }
void InitGPIOHInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTH, pinnumber, edge); }
void InitGPIOIInterrupts(unsigned int pinnumber, unsigned int edge){ InitGPIOInterrupts(PORTI, pinnumber, edge); }
